{
  "A bambi": {
    "meaning": "Someone who is terrible at everything and just there to make up the numbers.",
    "example": "“That team is shit, one of them is definitely a bambi”"
  },
  "A BamSam": {
    "meaning": "A person who thinks they're a parkour master, who is actually an epic fail.",
    "example": "Person X: Dude, did you see Nick fall in the trash can when he was jumping off the roof?Person Y: HE IS TOTALLY A BAMSAM. "
  },
  "a banana": {
    "meaning": "1. A yellow fruit that you peel and eat2. Sometimes referred to as a cock",
    "example": "1. I just ate a banana2. That is a very large banana you have Blair "
  },
  "a band": {
    "meaning": "A band is another way to say one thousand dollars.",
    "example": "I got a band for you"
  },
  "a bape and a year": {
    "meaning": "An expression used to describe an extremely long time between either seeing or talking to someone, similar to the ghetto term of a hot minute. Bape is used in this context to make the time seem much longer.",
    "example": "Bro 1: Yo son, I haven't seen you in a bape and a year since the last bro circle. Bro 2: I know, how's your mother? "
  },
  "a barbara": {
    "meaning": "a she-male, or rather, a pre-op transexual",
    "example": "the league of gentleman's taxi driver is the original article: a barbara"
  },
  "A Barber's Cat": {
    "meaning": "Seldom used nowadays and of obscure origin, it is generally defined as one with an overly exaggerated opinion of one's own importance and/or knowledge.",
    "example": "\"Adolph Hitler, when you really think about it, was little more than the ultimate example of a barber's cat.\""
  },
  "a barbie": {
    "meaning": "A pretty girl.",
    "example": "Ree: \"that bish is a barbie\""
  },
  "A Barkley": {
    "meaning": "Charles Barkley. CB is know for his power to block incoming balls from the hoop. Similarly, a Cock Block (CB) is known to stop incoming balls from getting to their goal. A Barkley acts as a huge CB (Cock Block).",
    "example": "-Charles Barkley-Your guy friend who is horny too -Your guy friend who is better looking -Your horny guy friend whoes not actually your friend-A hot girl's fat friend \"That beez is such a barkley\" "
  },
  "a barlow": {
    "meaning": "someone who seems really funny but once you get to know them you realize that they are, in fact, not funny (and racist).",
    "example": "Hey, I used to think that kid was funny but then i realized he was a Barlow...nut sack!!!!"
  },
  "A Barn In Arkansas": {
    "meaning": "\"She looks like a barn in Arkansas\" In short meaning \"she's ugly\". A phrase created by the popular Youtuber ChilledChaos in a video of himself and friends playing wheel of fortune.",
    "example": "1. (Direct quote from the video)Chilled *in southern accent*: \"Yeah just like a barn in Arkansas\"Chilled *normal voice*: \"what does that mean?\"*southern accent*: \"It means she's ugly\"2. Friend 1: Bro did you see that girl I hit up yesterday!? Friend 2: Bro what you mean? She looks like a barn in Arkansas "
  },
  "a barney": {
    "meaning": "while giving a guy a blow job, you sing the \"i love you song\" from barney.",
    "example": "oh lala gave him a barney? what a slut"
  },
  "A Barney Fife": {
    "meaning": "A Barney Fife - Giving the impression of having comprehensive knowledge about everything, but in reality, knows absolutely nothing,",
    "example": "As a rule of thumb, a Barney Fife is when you your transducer over there and connect it to your induction unit over here, then you hook them both, to your power cell over here. Of course, your definitely gonna wanna protect...ummm...your privates with a lead blanket, especially if you’re thinking of having kids at some point, seeing as this baby pumps out, as of yet, unknown levels of exceedingly dangerous radiation.while order operational."
  },
  "A Barnsley": {
    "meaning": "An unexpected semi.An unexpected semi errection, like Barnsley's run in the 2008 FA cp reaching the semi final's",
    "example": "Dude, last period I had a Barnsley."
  },
  "A barrel full of monkeys": {
    "meaning": "This term is used as sarcastic description of something not being very much fun. A barrel of monkeys are actually little plastic monkeys, and their arms can loop together to make a chain. In other words, not very fun.",
    "example": "\"Dude, how was your grandma's house?\"\"It was a barrel full of monkeys\" "
  },
  "a barrel full of smashed assholes": {
    "meaning": "n.  Theoretically, an awful thing.  Quite literally though, a barrel, containing any number of assholes that have been previously smashed. 1. Used to denote a foul visual appearance; Ugly. 2. to indicate a repugnant odor; often includes the word 'unwiped'. 3.a large quantity of drunken buffoons; may indicate anger and/or cockiness. 4. May indicate anger or cockiness for an individual where appropriate. A general feeling after a night of heavy alcohol consumption. This is a piratical reference to booty or plunder.  The gold and silver coins looted during raids were minted in the likeness of Kings, Queens, and other nobility and aristocracy.  A derogatory reference to the nobility and its wealth, each coin representing the \"asshole\" who had his picture \"smashed\" onto the surface.",
    "example": "Oh no, holy shit!  That girl who just came in the bar - she is uglier than a barrel full of smashed assholes! \"Gene's dog was uglier than a barrel full of smashed assholes.\" \"When Sheila came home from the cattle auction, she smelled like a barrel full of unwiped smashed assholes.\" \"Murphy's pub had a barrel full of smashed assholes.\" \"I've had enough of your attitude, Smitty. You're as fun as a barrel full of smashed assholes.\"  I feel like a barrel of smashed assholes \"Now bend an ear you scurvy dogs and listen close, there's a barrel full of smashed assholes on board yon vessel and we'll be taken all of it 'for nights end, whores and rum for months to come me boys.\""
  },
  "A Barrell Full of Cock": {
    "meaning": "Trouble.  An undesireable place.  A place or situation that you want to get away from ASAP!",
    "example": "\"Great! Here come the cops... you really got us into a barrel full of cock this time!\" Can be used to say that someone is lucky:\"Man... that guy could fall into a barrell full of cock and come out with a handfull of pussy!\" "
  },
  "A Barrowman": {
    "meaning": "Happens when a striaght person has a crush on a homosexual man.Originated when, gay actor, John Barrowman played the incredable sexy Jack Harkness on the remade Doctor Who series.",
    "example": "A: Oh my god, he is so sexy!B: He's gay, you know... A: Fine, I'll have a Barrowman "
  },
  "a Barry": {
    "meaning": "while performing Anal sex with your partner you proceed to donkey punch them and while unconscious you give them an arabian mask take pictures and Set it as there default social networking site of choice picture.",
    "example": "Last week I gave Jane a Barry and she hasnt talked to me since."
  },
  "a barry burton": {
    "meaning": "A very intense poo (may result in stinging)",
    "example": "After a rather exessive meal at a classy restaurant the need for a poo has heightened. This results in a long serious poo in the restaurant rest room or a random toilet. The poo can take upto an hour leading to serious mental strength loss and the waste (poo) results in an image like the late great Barry Burton hence a Barry Burton."
  },
  "A bartlett": {
    "meaning": "A man who acts camp/homesexual/gay but has not yet come out of the closet or it is not known whether they are homesexual.In some circumstances, a bartlett can mean a gay as well.",
    "example": "I looked across at him.. I could tell he was a bartlett by the way he interacted with those girlsWhat a bartlett!"
  },
  "A Basby": {
    "meaning": "A facial expression , or look characterized by shock, disgust, suprised or conveying thoughts of stupidity towards the person being looked at.",
    "example": "\"Some guy tried to pick me up at the bar with no teeth. He had the nerve to ask me if I was feeling him. You know I gave him A BASBY!\""
  },
  "a basic bitch": {
    "meaning": "Someone who is unoriginal and does things because others do it.",
    "example": "Me: \"Let me look up my name on Urban Dictionary & post it on snap!\"Friend: \"No don't do that you'll look like a basic bitch!\" "
  },
  "A Basket Full of Bald Kittens": {
    "meaning": "A place full of sexy gurls showing off their pussy's which have been shaved, waxed or lasered....... (As opposed to a Basket Full of 'Fuzzy' Kittens)",
    "example": "\"damn there's A Basket Full of Bald Kittens in there\""
  },
  "A Basket Full of Fuzzy Kittens": {
    "meaning": "a place full of sexy gurls showing off their pussy.  Xmas gift for Large Dogs",
    "example": "\"damn theirs A Basket Full of Fuzzy Kittens in there\" \"You got to give that mad dog of yours somethin'for Xmas to quieten him down. I read the local petshop's got an offer on A Basket Full of Fuzzy Kittens for $10.99\" "
  },
  "a basketball": { "meaning": "orange", "example": "a basketball is orange" },
  "A Basshole": {
    "meaning": "A Basshole is a person who loves to bass fish. This term was coined on the bass fishing website, TheBassholes.com",
    "example": "You can always find Jared on the lake fishing because he is such A Basshole."
  },
  "A baster": {
    "meaning": "A dude whose sole motivation in love making is to baste his partner's face with man gravy.",
    "example": "Janet: I told him he could come inside me but insisted on shooting his wad all over my face disregarding my plea not to do so.Branda: What a baster ! Janet: Tell me about it, I'm still partially blind ! "
  },
  "a bathroom dip": {
    "meaning": "when your friend says shes going to the bathroom but shes really going to get snacks",
    "example": "meg; hey erin im just gona go to the bathroom real quicka bathroom dip"
  },
  "a batman": {
    "meaning": "To pull a batman is while having sex in the doggie position the male shines a light on the roof and while she is distracted yell to the bat cave and stick it in her ass 2 grams of marijuana",
    "example": "Dude I pulled a batman with my chick turns out she likes anal Just picked up a Batman from Johnny down the block"
  },
  "A Batt": {
    "meaning": "A person that takes a poo in the shower and then breaks it up with their toes so it can easily be washed away.",
    "example": "Tommy did a Batt last night. It smelt awful and took a while to clean up."
  },
  "a batty boy": {
    "meaning": "a batty boy is someone who is a proper reatarded batty boy",
    "example": "“Your a batty boy mate”"
  },
  "a battybum": {
    "meaning": "A battybum is someone who is a battybum and likes poking people",
    "example": "“Will you stop poking me your a battybum “"
  },
  "a bay bay": {
    "meaning": "A whack song made by hurricane chris. the worst rap song published in the 21st century.  This song sets back the black rights movement by atleast 20 years.   What a dip shit says the gayest shit to be played on the radio Song by Huruicane Chris, that many ignorant people mistake for the chant \"Hey Baby\" but A Bay Bay is actually the nickname of local DJ, Hollyhood Bay Bay, who is part of Hurricane Chris' crew.   slang for hey baby; something that u say 2 show interest in a hot gurl in the clubmade popular by the song A Bay Bay by Hirricane ChrisA Bay Bay is a song by Hurricane Chris. He makes it seem like this song is talking about a girl he's trying to \"get wit\" but he's actually talking to the dj.....Gay or clever.....I say gay.",
    "example": "A bay bay is a stupid phrase...who uses it anyway? Hurricane chris is just a poser rapper who got lucky. stupid ass niggas in the club a bay bay homie 1:oh homie G (add more generic urban slang)homie 2:yes ma home dog homie 1:look at that fine female homie 2:hey lets make total asses of ourselves.  ya down?homie 1:sure both homies together: a bay bay.  Hurricane Chris acts like he's bad ass cuz he sings \"a bay bay\"\"A bay bay this my song turn it up\"-since A bay bay is a DJDamn!!! Look at that hottie! A Bay Bay  When I see a bad bit.. I'm hollerin out a bay bay...  A bay bay thats my song turn it up "
  },
  "A Beach Girl": {
    "meaning": "A beach girl is- a girl you can describe as being like a beach...like the beach this is a girl who will let just about anyone lay on her. she often smells like fish, is usailly full of crabs and at the end of the day you always wish you had put on my protection because of a new burning sensation...",
    "example": "i am pretty sure your new girlfriend is a beach girl..."
  },
  "A Beaker": {
    "meaning": "When someone makes a frown so intense that it resembles the muppet character, Beaker. Usually reserved for a late night intoxicated photo opportunity",
    "example": "\"That guys frown was so intense. It's definitely \"A Beaker\""
  },
  "A Bean": {
    "meaning": "One Hundred. 100% or $100Used in reference to money or keeping it 100% upfront and real with someoneAlso see \"Keep it a Bean\"Similar to a pox party, adults expose themselves to people who have contracted Coronavirus (COVID-19) disease in the misguided hope that they will have recovered from it before hospitals have been over-run with people and treatment isn't possible.To be one hundred with another, also know as real and being honest with another person.100 or 100%",
    "example": "\"I dropped a Bean on a date with that jawn last night\"\"I'm gonna keep it a Bean with you homie, she wasn't that into you\"Anyone game for a corona party? BYOB!Imma keep it A BEAN with you I ate all your food yesterdayThose Jays cost me a bean or I’m gonn keep it a bean with you."
  },
  "a beanie": {
    "meaning": "a beanie is someone who is completely flawless and beautiful in every way. She will always have your back and be there for you in any situation. You would be extremely lucky to have a beanie as a best friend because they’re extremely rare. Bean is really funny and makes you laugh 24/7.",
    "example": "“ wow you look like a beanie today ! so pretty “ saïd izzy"
  },
  "A Bear Grylls": {
    "meaning": "The sexual act of a girl sucking you off as you hang from the ceiling or beam and after you finish you proceed to drink your own piss. This can also be substituted by hanging from a tree, rope, pull up bar, etc. all by your ankles.",
    "example": "\"I'm feeling like a Bear Grylls tonight, what about you?\"\"I always enjoy a Bear Grylls while camping!\""
  },
  "a beard": {
    "meaning": "  A women who goes on a date with a gay man to mask the fact that he is gay. A woman that a homosexual male dates or marries as a cover for his true sexuallity.  A woman who is dating a gay man and who unbeknownst to her is covering for his latent homosexuality.  A beard is a unit of time, 30 minutes to be exact. This is the amount of time it takes Mrs Rhodes from Newlaithes School to grow a beard. The amount of time it would take to get from one place to another, defined in terms of the amount of facial hair that could be grown before you get there.  From legendary Gower surfer, 'Bryn-Dogg.'",
    "example": "  Boss asks you and your girl friend to join him and his wife for dinner, you accept. ( Boss suffers from severe homophobia ). You need a beard.  Everyone knew Don was gay.  His wife, Sally, was just a beard. \"Greg doesn't really like Susan, she's just a beard.\" \"I'll be over in about a beard\" 'It's about a beard in that direction', or 'Go that way for a beard', or 'It takes about a beard'. "
  },
  "A Beasting": {
    "meaning": "A time on a Monday evening when a certain individual and his mother take off their clothes and put baked beans (must be heinz) up their Mothers anus and fart them into the mouth of the partner",
    "example": "Last night me and my dear mother had a beasting, it was a very pleasurable experience."
  },
  "A beat": {
    "meaning": "Noun/Verb.A term for masturbation. sounds better than \"A wank\" Comes from the \"bate\" in masturbate Similar to a pox party, adults expose themselves to people who have contracted Coronavirus (COVID-19) disease in the misguided hope that they will have recovered from it before hospitals have been over-run with people and treatment isn't possible.A Beat is a public toilet or public restroom where gay men congregate to pay homage to Priapus. Please see cock worshipper and George Michael. A Beat is the Gentleman's toilet or lavatory where George Michael displays his sexual talent as an alfresco cruising artist bent over a urinal. Visual material of beats can be seen and heard on George Michael's single, \"Outside\", where George plays up his arrest for engaging in a lewd act in a notorious public restroom at a Beverly Hill's city park.  Beats are public toilets where heterosexual policeman who are in fact confused homosexuals go to live out their sexual fantasies, or at least get close enough for a taste of them. A dirty beat has been satirized as Courtney Loves mouth.To be beating, or following rhythm of some sort.",
    "example": "Example 1)Dylan: \"bro I cant wait to get home\"Jarrod: \"yeah, only so you can have a beat\" Example 2) \"Bro I had a mean beat last night\"  Anyone game for a corona party? BYOB!\"I saw this Big Greek Dick sticking out of the bushes on the 'Hampstead Heath' in the U.K!\" \"I could have sworn it was George Michael's.\"  \"I've seen beats in third world countries that are cleaner than Courtney Love's mouth!\" Jason was sick of going to all the beats in Melbourne, so he decided he would bring them to his house by graffiti'ing his name and mobile number up on the urinal wall. See beatslut and A Beat.Caffeine helps to keep my feet abeat the road ahead.Abeat is to beat, as afloat is to float."
  },
  "a beating from the love truncheon": {
    "meaning": "to slap a woman roughly in the face with your penis. Works better with a massive penis. to creep up on a girlfriend from behind and slap your cock off her cheek\"",
    "example": "Davidson quite regularly takes a beating from the love truncheon. \"if you beat me with your love truncheon again im never gonna suck it again\""
  },
  "A Beatles Song": {
    "meaning": "Any song that has a play-length that is under three minutes, like majority of The Beatles' songs.",
    "example": "Dan: This song is really good but it's only a minute and a half long.Bud: Yeah, it's like a Beatles song."
  },
  "A Beaut": {
    "meaning": "When you snipe in hockey",
    "example": "That goal was such a beaut. Jake just scored a beaut of a goal"
  },
  "a beautiful lie": {
    "meaning": "Is saying something so amazing that makes people feel all good inside, even if they know is not true. 1] An album by 30 Seconds to Mars.2] A lie told by the men Beyoncé and Shakira describe as beautiful liars. 3] A pretty bed or couch. 4] The word `lie` emblazoned  in pretty letters on a surface. -the second album from 30 seconds to mars, was released in August 2005, and has gone platnium. An amazing record!",
    "example": "I can't be mad... coz it's such a beautiful lie! -looks at wallThat`s a beautiful lie. Dayum i love dat new smokin album, \"A Beautiful Lie\" by dem finnnee bois in TSTM! "
  },
  "A beaver attempt": {
    "meaning": "To attempt to give a ladies pleasure parts some horizontal refreshment, only to discover that it is far to hairy and looks like Bob marley in a leglock, thus you calling a taxi and going home. a pathetic attempt at oral sex.  (i.e. it was bad) OR a failed attempt at getting some. A burning in the eyes, nose or throat when beginning to go south of the border on a lady.",
    "example": "Bloke in pub: Here mate went for a beaver attempt with this lass last night only to discover i needed to get the council in to trim her bush. Gregorious made a beaver attempt on his cousin. How did your date go?ANSWER: I almost had to call hazmat on a beaver attempt! "
  },
  "a bebo": {
    "meaning": "those people on the website bebo where it is impossible to determine whether they are emo or chav due to their photos (usually emo-style) and typing (azn caps)",
    "example": "person 1: she's so emo! look at her picture! all you can see is fringe! person2: no she's not! she's a chav! look at how she types and what she's saying! person 1: oh god! what is she?? person 2: oh no... she's A BEBO!! "
  },
  "a becky": {
    "meaning": "A girl who like Tumblr but is a hipster, like a megan! Spilling a drink almost immediately.If becky does a Becky it doesnt count and should be followed up with \"I haven't done that for ages\"",
    "example": "Wow that hot chick is such a Becky, taking selfies. Grandad did a becky"
  },
  "A bee that gives": {
    "meaning": "they are Boo Bees",
    "example": "A Bee that gives the milk from the magnificent breast of a woman breast feeding a new born child.It's been said that anything over a mouth full is wasted. "
  },
  "A beef jerky": {
    "meaning": "A beef jerky.A beef jerky is the act of giving or receiving a handjob. Usual one would use saliva or some sort of lube for a handjob; a beef jerky requires uncooked ground beef.Why do you ask? Say your camping, forgot to bring lube and both you and your partner have the pasties. Look no further then a pack or room temperature ground beef.You can also use other ground meats.If your partner vigorously jerks fast enough this will create enough heat to have a meal after sex.",
    "example": "Hey grab a handful of that ground beef and give me a beef jerky."
  },
  "A Beer For The Shower": {
    "meaning": "An unabashedly hilarious website dedicated to beer, music, and the dumbfuckery of humankind.",
    "example": "Ronnie, you've never heard of A Beer For The Shower? What are you, braindead?"
  },
  "a beiber": {
    "meaning": "A beiber is a very small penis. Usually under 4 inches.",
    "example": "John was embarrased when everyone found out he had a beiber."
  },
  "A Belgium": {
    "meaning": "A Belgium occurs when a partner about to receive penetration is expecting a slow, manageable entrance but is instead surprised by a hard and fast penetrative strike (much like Germany's attack through Belgium in world war 1).",
    "example": "Ted: Bro did you bang Jackie last night?Jeff: Yeah man, I gave her a Belgium, she is still in shock. "
  },
  "a belly nipple": {
    "meaning": "An outie belly button",
    "example": "You can see through that guy's shirt, he has a belly nipple."
  },
  "A Ben": {
    "meaning": "10 draw of weed Slang for a 100 dollar bill. A person who always thinks and/or acts like they know what they are doing or talking about, but is winging it and has no clue. A person with great insight of the future. The greatest son, a best friend, helpful mind and kindest of all. Artist and creative in many ways. A unit of measurement equal to 4 inches.  A ben is when you harm or kill your self in any sort of way ( your a idiot)",
    "example": "Oh I'm going to get a Ben later Guy 1: Damn son I like them shoes!Guy 2: Yeah got em on the internet. They cost a ben. Please stop being a Ben about it and listen to me  Do you have a friend? it needs to be like Aben \"Oh dear you only have a Ben\"  John '' Liam Just Died , by suicide''Kean '' Liam Did a Ben''Liam '' Oh yeah I did''Ben '' STOP USING MY NAME AS A TEMR!''"
  },
  "A Ben Farrell": {
    "meaning": "When the woman in a relationship makes the man her bitch",
    "example": "That poor man he’s in a Ben Farrell relationship"
  },
  "A Ben Kenobi": {
    "meaning": "When someone you're with seems to instantly disappear into thin air,Taken from the battle between Darth Vader and Ben Kenobi in Star wars IV where Kenobi is hit, disappears and leaves a pile of robes on the floor.",
    "example": "  Tom: Where the fuck's Smit gone Miles: Eh...Looks like he's done a Ben Kenobi. shame he left that pile of robes.   Tom: Shit. Miles: in all seriousness he's probably just gone for Dinner.   Tom: We're not nerds. "
  },
  "a bender": {
    "meaning": "On one ,drunk,stoned,fucked up A bender is used to define someone who choses to go to a STAR WARS pub quiz instead of playing football with the lads.",
    "example": "He was on a bender last night. \"Sorry lads i cant play football tonight as im going to a star wars pub quiz becuase im a bender who takes it up the bum\""
  },
  "A bendy one": {
    "meaning": "What you say as a response when someone says they are \"as straight as a ruler\"",
    "example": "Tim: What? You think I'm... I'll tell you right now, that I'm as straight as a rulerBob: A bendy one. "
  },
  "a Bengal": {
    "meaning": "a girl who looks smokin' from far away but upon coming close you see her face and she's ugly. good jersy, bad helmet i.e. the Bengals. derived from the ferocious Bengal tigers, calling someone 'a Bengal' means he/she is fierce; a savage  1. Classy 2. Sexy3. Good looking 4. Intellectual 5. A Winner A Bengal is someone who originates from Bangladesh, a country located in South Asia. Bangladesh is a country full of rich culture and history. After enduring years of struggle and hardship, Bengals have become independent, strong and ambitious.",
    "example": "\"Yeah, that girl's a Bengal.\" \"She looked good from the boat but when we pulled close to the dock I turned around after I saw her face.\" She can purr like a cat when she is happy but if you rub her on the wrong side, she'll turn in to a Bengal. And when that happens, Scram! \"yo that chick is a bengal..\" \"that guy MUST be a bengal, hes soo flyy\""
  },
  "A Bengali Menace": {
    "meaning": "A brilliant, handsome, and charming man.",
    "example": "A Bengali Menace was the role model for generations of young men."
  },
  "A Benj": {
    "meaning": "A Huge cock that is so large it can not be described as a monster cock (12-18 inches)",
    "example": "Wow you hear Kodie got hit by a Benj last night..."
  },
  "A Benjamin": {
    "meaning": "The OG shit bloke. This guy will use and abuse and rubbish you all day for shits and giggles, there’s no stoppping until you break or they break themselves, not knowing when to stop",
    "example": "Billy picked on sally until see cried and kicked him in the balls. Billy is such A Benjamin"
  },
  "a benny": {
    "meaning": " A One Hundred dollar bill. In Derbyshire and Yorkshire (UK) to have \"a benny\" means to get annoyed. A person of homosexual persuasion. Benny is a play on the word bent.   Someone who does not live by the shore, or appears to be out of place at the beach. A 1960's term refering to a group of people beating the shit out of one person.",
    "example": "It'll cost you a benny. \"My friend threw a benny when she realised I had drank all the beer\" Are you a benny tied to a tree. No?? BENNY ON THE LOOSE!!!  You're wearing shoes on the beach?  What a benny! After the football game there was a benny."
  },
  "a Bernad": {
    "meaning": "A person who swears a lot and is always drunk out of his or her skull!!!",
    "example": "\"Bleeping hell Bleep Bleep gime more booze!!!! \",\"Look at that bloke\",I see him\",\" Jeeze he's a Bernad"
  },
  "A Bernie": {
    "meaning": "A person that no one likes or cares about or is really gross like a burnt pod",
    "example": "You’re ex is a Bernie"
  },
  "a bert": {
    "meaning": "After a bout of anal sex, you provide your sexual partner with a shit uni-brow by slapping your shitcock across their eyebrows 1. derogatory term used for someone who can't \"get any\" might have glasses, wear hockey jerseys all the time, have in-depth conversations with teachers, and may possibly be jewish  1.  derogatory term used for someone who can't \"get any\" might have glasses, wear hockey jerseys all the time, have in-depth conversations with teachers, and may possibly be jewish   After a nice round of anal sex..Provide your sexual partner with a unibrow of nothing but shit...:D",
    "example": "\"Honey, would you mind if after our ass-fuck I would bert you?\" You couldnt even get any from that prostitute after you offered $100? You're such a bert. You couldnt even get any from that prostitute after you offered $100? You're such a bert. I fucked liz and then gave her a bert,.She looked like bert from Sesme street "
  },
  "a best friend": {
    "meaning": "A best friend is a person that is unique and beautiful. And will be there for you if your sick, or you need something, or you just need someone to give you a hug and say you are a great person. So if you have a best friend be grateful because not everyone has one.",
    "example": "A best friend reminds me to grab my homework"
  },
  "A Beth": {
    "meaning": "A rude, selfish bitch who apparently has no soul whatsoever. Whines like a baby and likes to think she is the princess of this world. Craves for attention and is usually a rating of 3/10 or lower. An interesting and unique way of refering to a person named Abigail. Abeth is only used by those of extremely high standards and are usaually well respected in society.",
    "example": "dang dude, that bitch is such a Beth. she wouldnt even give me a Rusty Trombone after i saved her life. Lord/Lady: Would it be possible for me to borrow your parasol Abeth whilst i visit my good friend the Queen this weekend?Lord/Lady:Would you care to join me Abeth in my attempt to relieve my gut in the little lady's room? "
  },
  "A Bette Midler": {
    "meaning": "“The Bette Midler” - When you and your significant other are in the heat of the moment and he decides to go down on you and you queef in his face…more than once.",
    "example": "Girl 1: \"Hey girl!\"Girl 2: \"Hey, Whats up?\" Girl 1: \"So, I gave Stanley a Bette Midler last night, He loved it!\" "
  },
  "a better hand": {
    "meaning": "The way one refers to their SO since their SO sex organs are better than their own hand, fingers, and so on for sexual gratification.",
    "example": "Paul: \"Yeah, Ally is just the best all around.\"Samantha: \"She's a better hand, eh? Paul: \" You want to give it a shot?\" Samantha: \"Nope.\""
  },
  "a better name than that": {
    "meaning": "A Better Name Than That or ABNTT is a team in the youtube show BFB with contestants : Tennis Ball, Blocky, TV, Grassy ,Robot Flower, Basket Ball, Golf Ball and 8 Ball. The team name is a mistake when golf ball said our team must have a better name than that.",
    "example": "a better name than that is my favourite team in bfb"
  },
  "A Better Place": {
    "meaning": "a \"place\" where people claim to be when they have left emotional baggage behind; whether this is true or not is only shown by their behavior Euphimism for Death, kick the bucket, to indicate that someone has died and gone to Heaven, \"A Better Place\".",
    "example": "After years of therapy and reading self help books, he claimed that he was in A Better Place, but his actions showed that this was not the case Mother Theresa is in A Better Place now"
  },
  "A Beverly": {
    "meaning": "When you have gone three or more days without shaving your pubes, You have a \"Beverly\" Goin' on.",
    "example": "I Really have \"a beverly\" Goin' On, I need to shave my pubes.OrLets fuck after you shave that \"Beverly\"."
  },
  "A Bevis": {
    "meaning": "Eating your weight in food.",
    "example": "I completed a food challenge and put on a Bevis."
  },
  "A bevv": {
    "meaning": "A good looking or peng lad according to Lucie",
    "example": "Oh my god Missyyyyy look he’s such a bevv!"
  },
  "a bevy": {
    "meaning": "an alcoholic beverage (hence where the word comes from), or the result of comsuming it.",
    "example": "\"let's go down the pub for a bevy\"\"i was pure bevvied last night!\" "
  },
  "a bevy;": {
    "meaning": "an alcohol drink, mainly beer",
    "example": "I'm going to the pub to have a couple of bevys"
  },
  "a bevy; pulling a bevy": {
    "meaning": "a drink, as in beverage, usually alcohol-variety; pulling a bevy? pulling a pint, I suppose!",
    "example": "Fancy a bevy? Will you take care of the bevvies?"
  },
  "a bi ga v usta?™": {
    "meaning": "a bi ga v usta?™ = would you like it in your mouth?",
    "example": "<Fernando> a bi ga v usta?™<rizlca> ne <rizlca> dobro jutro <Fernando> a bi ga v usta?™ "
  },
  "A bible": {
    "meaning": "Clearly free and you definitely need one",
    "example": "What’s A Bible ? Something you definitely need sis."
  },
  "A Biblical Catastrofuck": {
    "meaning": "The definition of a non comparable and non redeemable messed large scale mess up beyond any historically reconcilable measure and or action. ( An immeasurable (faux pas) Castastrophy in Biblical terms and beyond",
    "example": "\"Your behavior and actions are tantamount to a biblical catastrofuck\""
  },
  "A bicknasty": {
    "meaning": "A person that generally likes to have a good time with soda and water, and who is very sober, and who will make you laugh when they are sober, also, if the person drinks too much water, they'll puke, and say #1",
    "example": "Did you see a bicknasty last night?- yeah I saw bicknasty! He loves to have a good time!"
  },
  "a biddy biddy may": {
    "meaning": "Extremely localized late 80's rogers park Chciago Stonerspeak for \"are you stoned?\" There are only two proper responses: ahachna (pronounced a HACH na) meaning, NO, i am not stoned,  and A BIDAY MOO (pronounced AYE BIH DAY MOOOOOooo with the mooo drawn out in proportion to ones stonedness) - meaning, yes indeed i am quite stoned.  other acceptable responses might also include details about the degree of stonedness which one has personally achieved or is experiencing.  we have: stoned, meaning, STONED      gargotzed, meaning, quite stoned",
    "example": "x: a biddy biddy may?y: ahachna! hook a brova up! x: a biddy biddy may? y: a bih day moooooooooooooooooooo i am totally gargotzed "
  },
  "A bidet": {
    "meaning": "When a man/woman spits on another man or woman’s asshole before anal sex",
    "example": "“Tommy I forgot my lube in the car”“That’s okay honey, I’ll just give you a bidet” "
  },
  "A bieller": {
    "meaning": "A fat chode like body",
    "example": "Dude, that guy is such a bieller!"
  },
  "a big answer": {
    "meaning": "When some makes ‘a big ask’ of you and you deliver in a major way. a big ask, big ask, big answer, deliver, get r done, get it done, taking care of business, handle your business, doing work, helping",
    "example": "When I asked you to take care of my kids for a year while I went to rehab was a big ask. You took care of them and started a college fund for them. You delivered a big answer. Thanks!"
  },
  "a big ask": {
    "meaning": "Apparently used once by Alf in Home and Away, this is an odd phrase which turns the verb ask into a noun.  Of all things!  Research indicates that it is generally used in sports and business, and randomly by Australians. It also seems to have been embraced by Friends of the Earth, being the name of their campaign against climate change.",
    "example": "I know it's a big ask, but can you stop climate change?"
  },
  "a big ass hole in the wall": {
    "meaning": "a big ass hole in the wall is aa big ass hole in the wall wall of a house or building.",
    "example": "How did your room get a big ass hole in the wall?"
  },
  "a big ass paragraph": {
    "meaning": "I don't like it, I never liked it, and if this is all you're gonna text me over summer after radio silence from you then first and you, Rosie, e.t.c had be to be so absorbed in my romantic life, my personal life, my WHOLE FUCKING LIFE, you had to find pictures of me from YEARS AGO, FUCKING YEARS, to bring back and show me and everybody else because i was so fucking ugly and so fucking fat you guys couldnt just keep the shit ñto yourselves, everybody had to see, everyone had to know what i looked like in 5th to 6th grade having as much fun as possible, I wanted to make memories so I took pictures of myself making those memories, but for the same reason of you ass hats i stopped taking those pictures, my camera roll is purely screenshots, i dont take pictures of myself anymore because of people like yall, alright now I know I went on a tangent but this has been sitting in me for a while and now you out of the blue send me that shit, kinda makes me mad yknow? But really, don't text me, ask me to hop on house party, call me on here, e.t.c, ANY way of contacting me, if this is all you are gonna send",
    "example": "Kevin sends you a big ass paragraph like this when he fucking hates you"
  },
  "a big bag of beans": {
    "meaning": "An annoying or otherwise less-than-ideal situation; an undesirable state for one to be in.",
    "example": "“Man, this new project is really making class a big bag of beans.”"
  },
  "a big bag of suck": {
    "meaning": "a  phrase to express how much someone sucked at what they just attempted",
    "example": "Dude, you didnt even clear that gap, you ate shit! That was a big bag of suck!"
  },
  "A big ben": {
    "meaning": "A high school (fuckboy) whom has a small penis and acts cocky in front of women and has a secret life no one knows about",
    "example": "You see that guy over there he's such a big ben"
  },
  "a big boobida": {
    "meaning": "A boobida is a big cute King Charles caviler that is so chilled and just lies there sniffing and being a big boobida",
    "example": "“See that there, that’s a big boobida he’s so cool and chilled “"
  },
  "a big bowl of nunya!": {
    "meaning": "When something is no one's business...nun ya bizzness",
    "example": "Frank: \"Why don't ya clean that nasty car? \"Margie: \"Hey Frank, have a big bowl of nunya!!!\" "
  },
  "A big boy": {
    "meaning": "Being fox his own self and his siblings and his mother disgusting fucking creature that has nothing to look for and suck dick every night",
    "example": "A Big boy suck his own penis"
  },
  "A big brabbin": {
    "meaning": "Cumming in 2 minutes and then have the girl cry in the corner because she regrets it too much",
    "example": "Damn Sophie gave me a big brabbin me last night"
  },
  "a big brick": { "meaning": "Nabin", "example": "Nabin is a big brick." },
  "a big chin": {
    "meaning": "n. a person with multiple chins:mostly names such as Nicky, have them",
    "example": "a big chin is someone that has multiple chinsex: that girl has a big chin, she has like 3"
  },
  "A Big Decision": {
    "meaning": "When the choice between two objects has either equally positive or negative effects, and so is really, really hard to make.",
    "example": "When the doctor offered Jim painkillers for his amputation, he knew he had to make a Big Decision. Be in terrible pain because he was missing a goddamn leg, or sit on the can and push out rabbit-poops while death-gripping the towel rack. Jim did not choose constipation."
  },
  "a big dick": {
    "meaning": "A penis 7in or longer",
    "example": "\"Girl the guy hade a big dick\""
  },
  "A Big Dick Swinger": {
    "meaning": "A Cranism for a person who most often is right and thus quite successful in their field",
    "example": "He's a Big Dick Swinger"
  },
  "A Big Dipper": {
    "meaning": "When making love to your partner and you leave half way through and go make love to another hooker",
    "example": "I was getting some last night when I pulled a Big Dipper!"
  },
  "a big faggot": {
    "meaning": "Someone who is big and a faggot",
    "example": "Walking round being big and annoying and one would say too his friend he is \"a big faggot\""
  },
  "A Big Fat Bitch": {
    "meaning": "A big fat bitch is someone who is a fat little bitch who can squish you're ass, it really hurts, and they will do it! Do NOT let them come in and fuck you in the ass, because then you're just fucked. I consider this a really good word for someone who is a bitch named Molly and she can literally squish the fuck out of anyone.",
    "example": "Molly is a big fat bitch who doesn't give a fuck about giving people attitude, they simple self-centered bitches"
  },
  "A big fat mad dog": {
    "meaning": "A human being who won’t stop going on about is silver Toyota and the fact that it’s the best car in the world. He is a Richard Hammond wannabe and dresses like a retired nonce",
    "example": "Jesus Christ Gary stop talking about your crap car you’re just a big fat mad dog"
  },
  "a big fat person whos also a gay ass pervert who spends all his time looking at porn": {
    "meaning": "idk",
    "example": "Hey daddy, can i look at porn online at your computer pls i want fuck people real hard online :) Im a a big fat person whos also a gay ass pervert who spends all his time looking at porn"
  },
  "A Big Fuck You": {
    "meaning": "\"A Big Fuck You\" Is a way of saying Fuck You to a greater degree, to really let that person know they gon fucked up and your pissed off about it because sometimes just a regular Fuck You just wont cut it. \"A Big Fuck You\" can be delivered in two main ways, verbally and phisically. Verbally can also be online or on the phone and physically usually refers to sports competetions, pranks and other in your face Fuck You's. \"A Big Fuck You\" can be given or recieved.",
    "example": "VerbalWhen DG sorority execs threaten to \"Cunt Punt\" their members. Thats a Big Fuck you.Physical When Lebron swats the fuck out of Tiago Splitter in the 2013 Playoffs. Also a Big Fuck You. "
  },
  "a big fucking deal": {
    "meaning": "Joe Biden's euphemism for Health Care Reform.",
    "example": "\"Hey Joe, what do you call this Health Care Reform Bill?\"\"This is a big fucking deal.\""
  },
  "A Big gay": {
    "meaning": "A Gay that us very large",
    "example": "Wow wudda big gay"
  },
  "a big girls blouse": {
    "meaning": "A male displaying percieved feminine characteristics through actions which cause his peers to think less of him.Being a big girls blouse is much worse than being just a girls blouse, thus it's highly insulting nature.Also used to force a man to do something they fear through peer pressure.",
    "example": "Chad:I don't want to to go sky diving while eating chilli.Mike:Don't be such a big girls blouse.get in the plane and bring the chilli. Chad:Fine... "
  },
  "a big had": {
    "meaning": "a chick you've laid and was way good in bed",
    "example": ""
  },
  "a big hand": {
    "meaning": "enthusiastic round of applause",
    "example": "Let's give him a big hand."
  },
  "A big hoe": {
    "meaning": "Dylan is a big hoe, bigger than Justin Bieber",
    "example": "Hey dude you seen Dylan recently?Nah dude why is that? Oh he just turned into a big hoe! Wow really?!"
  },
  "A BIG JIMMY": {
    "meaning": "A big tough shit. One that you really have to use your anal muscles to push out after eating a big meal the night before. And it hurts like hell when you push it out. It is sort of like a variation of constipation.",
    "example": "Guy 1: Hey dude, what took you so long?Guy 2: I had to do a big jimmy. Christ it hurt like hell."
  },
  "a big jobby": {
    "meaning": "1. A large brown solid that makes its exit from a creatures body through the anus. 2. David Becham",
    "example": "1. I just did a big jobby 2. I hate david becham for he is a jobby, in fact he's a big jobby."
  },
  "a big jock": {
    "meaning": "The greatest manager ever in Scottish football.Dignifiied huns try to sully his good name with lies about him, but it is well known that these vermin are just evil bigots from a vile sectarian message board who detest anything Catholic and Celtic and will make up any pish to look hard for their fellow Huns. The absolute scum of the earth. Desperately trying to hold on to their 'values' and 'history' in a modern world that frankly detests them. And they know it. Richard Gough anyone? ",
    "example": "a Big Jock was the first manager to lift Europe's top prize, the European Cup, now known as the Champions League.Many huns still wake up in the morning hurting. "
  },
  "A big ken": {
    "meaning": "Used to describe very large males",
    "example": "Boogie 2988 is such a big ken"
  },
  "a big lick": {
    "meaning": "A teachers pet. Someone who always tries to please the person in charge to a sickening degree. a person who is an industrial strength ass-kisser. they figure, whle they're down there,  they might as well give a full crack tongue job from bow to stern, just to notarize the event. to rob a large sum of things from a certain area or place  Your pocket cards in Hold'em poker are 6 and 9, you have a big lick. In contrast, an Ace and King are Big Slick. Something that cost a lot, or more than expected. Used when expressing surprise or concern over the price of something.  The act of acquiring a large sum of money in an unconventional, mostly illegal, manner. OR The act of loosing a large sum of money.",
    "example": "teacher: will someone do a message for me please? pupil (immediately): oh i'll do it sir!! While Ernie was kissing the supervisor's full ass, he gave a big lick since it was close to evaluation time. I just caught a big lick in Haines city, at this house by the lake. On the final table of my Texas hold'em poker tournament; the flop was two sixes and a nine (6 6 9), my pocket cards, a Big Lick (6 9) yielded me a full house. Taste like chicken.  Hey that was a big lick. I thought it would be less than that. Well I can’t afford it now after the lawyers fees that was a big lick\"were going to get ronnie back.\" \"Yeah for a big lick.\"                            OR\"rember when john gave you thoese fony Cd's.\"  \"Yeah that was a big lick\""
  },
  "a big noter": {
    "meaning": "Someone who takes a situation and embellishes it to make themselves look better than they actually are.",
    "example": "a big Noter: \"I'm driving my BMW down to my country estate on the weekend\"Reality: Driving a 1993 beaten up BMW down to the local trailer park."
  },
  "a big ol' vag": {
    "meaning": "Floppy meat wings, that are floppy beyond belief Over-sized labia that \"hang down\" noticably. Can also mean that the vaginal cavity is of unacceptable diameter and/or depth. ",
    "example": "that girl has a big ol' vag. 1) Man that slag had a big ol' vag! Swallowed my arm up to the wrist! 2) Man I couldnt even touch the sides of that big ol' vag!"
  },
  "a big pile of poo in a urinal": {
    "meaning": "Usually means when there's a pile of poo in a urinal. Professional incompetence or dishonesty. When a particular female, is either engaged in a relationship or is otherwise unavailable to those who would like to 'tap that ho'",
    "example": "I needed to take a piss but there was a big pile of poo in a urinal, so I used the sinks George W. Bush's foreign policy is just a big pile of poo in a urinal Guy 1: Man i wanna 'tap that ho' but shes being a big pile of poo in a urinal...i wanna use it but i can't.Guy 2: aww man that sucks mad balls, i just use the sink. "
  },
  "a big plate of shut the hell up": {
    "meaning": "n.a metaphorical meal sarcastically offered to a person whining and inquiring about food to somebody who doesn't feel like providing actual food for them",
    "example": "p1: \"I'm hunnnnngry. What's for dinner?\"p2: \"A big plate of shut the hell up.\" "
  },
  "a big poo poo head": {
    "meaning": "A euphemism for shithead. Usually used in a joking, lighthearted manner towards a friend. childish language meaning that the person referred to is absolutely and totally unfair and won't give the ~five year old whatever the hell they want.",
    "example": "Holly: Your breath stinks.Lulu: Shuttup you big poo poo head. Jenny screamed at her babysitter Chrissy that she was 'a big poo poo head' when Chrissy denied her mac 'n' cheese & hour of MTV's The Real World. "
  },
  "a big red": {
    "meaning": "To shit on someones car. After shitting, to proceed to rub doodoo around the car with ones own hand.  a red head who doesn't shave...in the crotch area",
    "example": "Last night I pulled a big red and shit on someones car.  You wanna tap that? Shes a big red I guess so.... Ill just have to plow my way through the firey forest to find her cave "
  },
  "A Big Red Button": {
    "meaning": "Something you press from curiosity and end up nuking the world.",
    "example": "A guy: *sees a big red button*The same guy: *presses the button* The guy again: hears a boom in the distance "
  },
  "A Big Rest": {
    "meaning": "To have a big rest is very similar to cotch. It is basically resting for a large amount of time with disregard to other activitys that may need attending to. Big Rest's are enhanced by any type of entoxicant. Dead.  A dirt nap.  The Long Sleep. ",
    "example": "We've been walking for minutes lets have A Big Rest It's time for A Big Rest \"You mess with Luthor's girlfriend, you'll be taking a Big Rest\"."
  },
  "A Big Saff": {
    "meaning": "When a 10/10 female offers the act of intercourse but not love coffee or conversation, and the male subsequently rejects this advance in lieu of talking to another female about animals or coffee grinds",
    "example": "“She begged you for sex? Surely you gave her the slabbcock?!” “Absolutely not, there was no conversation love or hope of a relationship in sight, I had no option but to pull a big saff on her!”"
  },
  "a big sucker": {
    "meaning": "When your girlfriend gives you a blowjob for so long that eventually your dick gets smaller and smaller just like a big lollypop sucker.",
    "example": "Dude, last night my girlfriend gave me a big sucker and now im three inches smaller!"
  },
  "a big warm glass of shut the hell up": {
    "meaning": "a comment you make when someone makes a statement that embarrasses or annoys you and you want them to leave you alone",
    "example": "While out skateboarding you fall and your friends start laughing at you because you missed your trick you shout back at them how about \"a big warm glass of shut the hell up\" and you try it man."
  },
  "A Bigawoo": {
    "meaning": "A big little person who is rather adorable.Originates from jargled babytalk.",
    "example": "\"Hooda Bigawoo? is oo a bigawoo? Oo is a bigawoo oo is!\""
  },
  "a bigger fish to fry": {
    "meaning": "When you avoid doing something, cause you have something more important to do.",
    "example": "- \"Why she didn't come to class?\"- \"Well, she had a bigger fish to fry.\" "
  },
  "a bigger lie than the cake": {
    "meaning": "A huge lie that no one will ever believe to be true",
    "example": "Dude 1: If you stick a finger in that electric socket, I'll give you a million dollars.Dude 2: Sweet!Dude 3: Don't do it, man. The million dollars is a bigger lie than the cake."
  },
  "a biggity bonus": {
    "meaning": "A bonus of supreme order. The biggest bonus there is.",
    "example": "Man1 to Man2: Shit! you just won a new car!Man2: A biggity bonus! "
  },
  "a bill": {
    "meaning": "$100 dollers Refers to a unit of 100 lbs.",
    "example": "Yo bro can you hook me up with a bill? \"Man, that girl is at least 2 bills\""
  },
  "A Bill Clinton": {
    "meaning": "The sexual act of recieving felatio while maintianing a perfect telephone conversation. Mastery of this act is considered achieved if one can ejaculate during the conversation without the person on the line suspecting anything is abnormal.  A penis that is bent or crooked, not directly straight from end to end. A picture of the Washinton Monument as the poser's penis while sitting somewhere on the National Mall in DC. A picture is considered a \"scandal\" if the poser gets a female to \"Monica\" the monument.",
    "example": "My mom called last night and just to mess with me Suzie gave me A Bill Clinton.  A Bill Clinton is a penis that is not straight. See Bill Clinton for more. Dude I got A Bill Clinton in DC this weekend"
  },
  "A Bill Cosby": {
    "meaning": "The act of drugging a girl and having your way with herSimilar to a pox party, adults expose themselves to people who have contracted Coronavirus (COVID-19) disease in the misguided hope that they will have recovered from it before hospitals have been over-run with people and treatment isn't possible.A Jell-o shot.Can also be called a Cosby or a Cosby shot.To put your penis in her asshole and she shits on it. You will have pulled out a penis with shit on it that looks like a pudding pop.Hence i got Bill Cosby ed",
    "example": "I just roofied Jenny now I'm going to pull a Bill CosbyAnyone game for a corona party? BYOB!They have a ton of Cosby's in refridgerator!Let's take a Cosby shot.I was ridiculous from those Bill Cosby's last night.I took a Bill Cosby. Now I'm throwed.I was fucking a woman i meet at the club in her ass and she she gave me a Bill Cosby."
  },
  "a bill fifty": {
    "meaning": "one hundred and fifty dollars To get slashed with a razor across the face, which normally requires 150 stitches to close up. A hat bill which is canted to the side and worn in the style of notorious gangsta rapper Fifty Cent.",
    "example": "man this bitch owe me a bill fifty and im about to collect. Yo, I just gave this dude a buck-fifty the other day Yo dog I showed up to the club sporting a bill fifty but the door guy made me straighten my hat out."
  },
  "A Bill Gates": {
    "meaning": "1.A wealthy or very rich person.2.Somebody who claims to be wealthy or very rich but actually he/she isn't. A wealthy or rich person.",
    "example": "X: nice suit dude.(trying to touch)Y:thanks dude.Hey watch it.That's a $2000 suit. X:When did you become A Bill Gates,Huh? Jay-have you seen Felix's new car? Rose-Sure,what about the car?Jay -it costs a fabulous sum.Don't you know that? Rose-Hahaha,haven't you realized that Felix is A Bill Gates. Jay-Well,yeah.But why would somebody wanna ride in such an expensive car? "
  },
  "B reserve": {
    "meaning": " The reserved parking area for pick at b’s.",
    "example": " Yo meet me at the b reserve. "
  },
  "B Rob": {
    "meaning": " a trolling motherfuckerjust kidding. A blonde babyfaced stud muffin who reels in all the ladies  Tits. Woman's breasts.  To perform a seemingly straight-forward action without any competency.  A backside flabalanche. A roll of back-fat that hangs over the belt. The opposite of a rob.",
    "example": " B Rob is such a troll  Wow, she has nice brobs!  That quarterback pulled a b-rob with that interception.  Look at that guy. He's got a rob AND a brob. How is that possible. "
  },
  "b rock special": {
    "meaning": " to bang 2 babes in the same night at 2 different parties",
    "example": " friend 1:yo man after I finish bangin this babe let's head over to the other party so I can bang another.friend 2: nice dude, I could only dream of pulling a b rock special "
  },
  "b rooe": { "meaning": " bitch.", "example": " you are a b rooe " },
  "b say harder": {
    "meaning": " Its when you be fucking yo bitch from the back and she screams\"harder daddy!\" making you FUCK THE SHIT OUT OF THAT FUCKING WHORE BITCH",
    "example": " yo man I was fucking my bitch yesterday and she was all like \"HARDER\" my b say harder aw man HARDER DADDY AH YES FUCK YEAH "
  },
  "b school": {
    "meaning": " B school can stand for \"business school\" or bride school.  Business school is where students obtain MBA's in the hopes of high paying jobs for dot.coms, where they will cash out their stock at age 35 and retire to Palm Beach. Oh yeah.  Bride School, or the School for Etiquette and Wisdom is where Korean gals go to learn how to be submissive, never giving orders to the husband, and not walking around in strapless mules that clack and disturb their elders. See h school for the male equivalent of bride school.",
    "example": " Part of the prenuptual agreement was that Karen attend Bride School and learn to bake pies, make sweaters and how to gracefully open and deliver a cold one while looking demur and sexy. "
  },
  "B sharp": {
    "meaning": " Noun. When in college and your teacher does not care much about legible grading. As a result it is hard to tell whether a person scored high or low with a B.",
    "example": " Fathead #1: What the hell is that thing? I dunno what I got, on the test. Does that say B+ or B-?Fathead #2: Looks like a B sharp.Fathead #1: Fuck you and your sweater. "
  },
  "b shirt": {
    "meaning": " a t shirt that was worn by a fat person for so long the belly part has inflated and given the t shirt the shape of a b.  A t-shirt you get free when every you buy a case of beer. Usually given away as a promotion.",
    "example": " person 1: let's get six third pounder and four large fries for dinner. person 2: dude now i get why you always wear b shirts  Frat Guy One: Hey, did you get the beer? Frat Guy Two: Yah, and a free b-shirt to go with it. "
  },
  "b simone tone": {
    "meaning": " Named after THE B-SIMONE got the whole world talkin like her",
    "example": " Baabyy giirll ~is what someone using the b simone tone will usually say. "
  },
  "B Slapped": {
    "meaning": " A way to say bitch slapped without saying the word bitch.Children say this thinking it's not going to get them in trouble.",
    "example": " Dad: how was school today? daughter: it was ok. Dad: did anything good happen? daughter: yeah there was a fight and this girl got B slapped in the face. "
  },
  "B Slide": {
    "meaning": " A slide preformed by Phillip Mitchell, which involves throwing yourself onto your kneecaps, and slide through an entire room.",
    "example": " \"Mitchell slided through the room. He made a B Slide\" "
  },
  "b smitty": {
    "meaning": " a extreme balla, a kid just so smooth and filthynastytight,a kid who walks in extreme favor and is blessed.A kid who balls all day of everyday",
    "example": " man tht b smitty is so legit "
  },
  "B some S": {
    "meaning": " To insert Salvia into a bong and light vigorously",
    "example": " \"Hey kids do you wanna go B some S?\"\"I need a better bong! This is S deserves better.\" \"Mate I swear daan I B some S like 24/7, standard.\" \"Why did that ganja make me trip balls? Dude, you weren't bongin' bud... that was some S.\" "
  },
  "b spike": {
    "meaning": " B Spike is a game.  It consists of one person calling the game and the start, \"B Spike! Starting now\". Anyone else who is playing cannot say a word starting with the letter B unless they immediately follow it up by saying Spike.  First:  \"Let's break it down\" \"Spike!\"  If the person who said the \"b word\" fails to say spike, they are defaulted and anyone can punch their arm until they realize what they said, say spike and give in. ",
    "example": " First: \"This is bulls**t!\" Second: punch punch punch, etc, you get the idea until they surrender and lose b spike. First: \"ok, alright! Spike!\" "
  },
  "B Spot": {
    "meaning": " Slang for Brain  A GSpot for gay men",
    "example": " You gotta turn on her B Spot if you're even dreaming of going for her G spot!  SHIT! Sinn torn my ass up he was grinding my BSpot ALL NIGHT LONG!! "
  },
  "B Squad": {
    "meaning": " A group of people that are less important/popular compared to some of your other friends  extreme group of drinkers that crash alot of partys and have alot of their own.  A group of Popular People who go around Slut dropping and showing off their breasts usually at the age of 13 wearing Nike and addidas that think there cooler than everyone else when there not.  originated in the members's 9th year of school... usually found making a scene in a public place, disrupting the peace, or disturbing innocent bystanders. travel in packs, dont allow eachother to \"loner\".  homosexual, a man who likes to have sex with other men.",
    "example": " Jake and Bill were busy today so I had to hang out with the B Squad.  The B-Squad's here, i hope they brought their own beer!  Here comes the B squad ... 😒  Person 1: Hey, why who was that making a scene at the diner?  Person 2: I dont know, but they were some HOTT BITCHES.  Person 3: Wait, it wasnt... Person 1: OMG! It was the B SQUAD!  Person 2: I feel honored  bsquad puts he's penis into a man's anal. "
  },
  "b squirrel": {
    "meaning": " a wang tang jang sang bang",
    "example": " the boi is a b squirrel "
  },
  "B Srolanh O Nas": {
    "meaning": " In Cambodia Girl and Boy Use this word to show their Love on each other . Like( I love you so much ) B Srolanh O nas ....",
    "example": " You: b srolanh o nasHer boyfriend: srolanh kdmh eyYou: somtus bong nh chat jlom sman tah SS nh "
  },
  "b stalking": {
    "meaning": " when someone gives you so much information to contact them there's no excuse not to talk to them, like backwards stalking",
    "example": " \"So how did you date go?\"  \"Horrible. This chick is b stalking me. I have her facebook, cell, home, e-mail....\" "
  },
  "b steeze": {
    "meaning": " a liar, who smells like shit and super edits her pictures to the point where, if you saw her in real life youd have nooo fucking clue who the hell she is. oh yeah, and she fucks camels.",
    "example": " kid1:so, i heard you were doing dangerous business with sewage pipes the other day. kid2: you mean b steeze? "
  },
  "b stock": {
    "meaning": " adj; noun  1. Products that are often not new, but could be in first class condition and/or that have been returned opened but not damaged. Usually on a 'first come, first serve' basis.  3. A girl that's not new and fresh, but neither is she damaged goods.  B stock is a unit that was used as a demo unit/ or display model normally by the manufacturer who then sells it to the retail stores at a lower price who then sells it to the public for a lower price.  Products that were returned or refurbished, that have been re-boxed at a company or contract location to appear new and therefore have a full warranty when they reappear on the store shelves.",
    "example": " 1. Damn dude, check out the deals I can score on this b stock merch.  2. Sometimes you just gotta pick up a girl off the b stock shelf.  We have that b stock item for 750 instead of the usual price of 900.  90% of what MicroCenter sells is b-stock. "
  },
  "b street": {
    "meaning": " B street is another word for Boundary / Boundary road, a ghetto area in Walthamstow, E17  B street is another word for Boundary / Boundary road, a ghetto area in Walthamstow, E17",
    "example": " Im reppin B street init  Im reppin B street init "
  },
  "b stubbs": {
    "meaning": " Some one who is the drunkest person at a party normally running into walls, or some one who is so drunk they crap their pants.",
    "example": " B Stubbs crapped his pants in the movie theater parking lot, then ran head first into a car door. "
  },
  "B system": {
    "meaning": " A level of \"b's\" standing for the word bitch to describe the level of how much you hate someone. The levels go from B.1-B.9. If someone is ultimately gay they are called a \"C\" which stands for cunt because its the most offensive word in the english language I hear.",
    "example": " Michsa from Wal-Mart is a B.7.   Maggie's B level was elevated to B.4 when she wouldn't suck my rag.   You're acting like a C today. "
  },
  "b team operation": {
    "meaning": " An organization possessing b team qualities.",
    "example": " Even though they managed to level the WTC, al qaeda is a prime example of a b team operation. "
  },
  "B Teeth": {
    "meaning": " The act of having completely fucked up teeth. I mean, completely fucked teeth.",
    "example": " \"Hey did you see that girl's teeth?\" \"Yeah man, she's got some total B Teeth.\" "
  },
  "B The W": {
    "meaning": " B•The•W - Spelled Pronunciation (bee-thuh-duhb-uhl-yoo)    –adverb   1.)By The Way 2.)The acronym “btw” which is shorthand for the phrase “by the way” but extended slightly. Often used by individuals who only feel compelled to abbr. certain parts of the phrase.  ",
    "example": " Oh, and B the W…browsing \"Craigslist Missed Connections\" is a great way to spend idle time while sitting alone in your over-priced studio apartment.  "
  },
  "b then d": {
    "meaning": " bang then dump.  have sex with then leave.",
    "example": " Dude, I like Chelsea but Id rather b then d than be in a relationship. "
  },
  "B there or b₂": {
    "meaning": " Classic phrase used by Mark lee and the foreign swaggers",
    "example": " “We have a show coming up, b there or b₂” Oooooo "
  },
  "b tits": {
    "meaning": " the hottest brittany around with the sexiest big ass titties that you wanna suck all night and jizz allll over.",
    "example": " damn b tits yous is beeaautiful girl. "
  },
  "B Tizzle": {
    "meaning": " A tasty toke off your bong  Affectionate urban slang for Bloomington, Indiana. Often: B-tizzle.",
    "example": " Hey dude, what say we go back to my place and take a B Tizzle  India-NO-place sucks ass. Y'all oughta come down to B Tizzle instead. "
  },
  "b to blow": {
    "meaning": " something markiplier said in a horror game",
    "example": " markiplier: want me to press b to blow "
  },
  "b to tha fay": {
    "meaning": " Shorthand for \"may i please have a beer for my face?\"  Used when uttering extra letters is simply not an option.",
    "example": " Man it's been a long week. I need a b to tha fay. "
  },
  "b to the biscuit": {
    "meaning": " Straight up virgin bitch!",
    "example": " Yo! That Rob Lunder is a b to the biscuit. "
  },
  "b to the fay": {
    "meaning": " b= beer fay=face b to the fay=putting a beer to your face",
    "example": " let's put a b to the fay tonite "
  },
  "B to the S": {
    "meaning": " Bullshit. Only, a more polite version with more ability to be said in public. Also on forums when you don't mean to cause too much offense.",
    "example": " WTF?! I call B to the S on that. "
  },
  "b train": {
    "meaning": " The train bitches ride. If someone is being a bitch you tell them they're on the \"B Train\"",
    "example": " Look lady, I dunno why you're ridin the B Train today, but you need to quit your damn bitchin'! "
  },
  "B trained bitch": {
    "meaning": " A B trained bitch is basically a bitch who only thinks about herself and thinks the world revolves around her. Girls who are called a B trained bitch's usually have horrible attitudes,a trampy style,gossip non-stop and have jealousy issues. The B in b trained bitch stands for bossy, big, brat, and anything bad that starts with a B..... <3",
    "example": " \"I told her one of my biggest secrets and she went and told that stuck up snob! What a B trained bitch!\" "
  },
  "B Triple F": {
    "meaning": " \"Best Fucking Friends Forever\"  Originally said in the movie Pineapple Express, this phrase has evolved into it's own catchy saying.",
    "example": " Cara: \"Why do you hang out with her so much?\"  Suzy: \"Cause she's like my B Triple F & shit!\" "
  },
  "b tube": {
    "meaning": " A homemade construction, often made from a water bottle or a toilet paper roll; the purpose for a b-tube is to exchange the smell of marijuanna for that of fabric softner.  A b-tube is made of a tube with pieces of fabric softner inside.  The word b-tube has derrived from 'bounce tube,' refereing to Bounce, a fabric softner company.",
    "example": " Example 1: Edgar: Yo esse, it's starting to reek in here Chale: No problem holmes, we'll just start using the b tube  Example 2: Harry: Yo man, do you have an fabric softner? Tom: Yeah, why do you need it? Harry: oh, no biggie, i'm just blazing in my room, and i dont want it to smell too much. "
  },
  "B up A": {
    "meaning": "B Up A. Refers to Modern Warfare (MW2, COD4, World at War). It means to \"give up\" or \"tap out\" and back out of the lobby before the game starts. You can tell someone to \"Bupa\" (sounds like \"Boopa\") if you want them to leave.Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.British Underage Porn Association.BUPA noun (boo-pah) \"Breast to Upper Pussy Area\" Similar to FUPA. BUPA starts at the breast, moving downward & swallows any evidence of one's torso. A very fat belly to pussy area.(Boo-pah)  - Big Upper Pussy Area, found mostly on older and/or fat women.a baby sized fupa that hasnt reached full potential Big Upper Pussy Area",
    "example": "Example 1:\"Man, you guys have no skill- you keep using your noob tubes\". \"Noob tubes? These are pro pipes. B UP A\"Example 2: \"I don't noob tube, I bro-pipe!\"The CNN crew was ejected, without explanation, from the BHAZ across from the White House.BUPA HEALTHCARE CENTRE. A wealthy hospital benefactor was being shown around the healthcare centre. When during her tour, she passed a room where a male patient was masturbating furiously.\"Oh my GOD!!\" screamed the woman, \"That's disgraceful!!! Why is he doing that?\"The doctor who was leading the tour calmly explained, \"I'm very sorry that you were exposed to that, but this man has a serious condition where his nuts rapidly fill with semen, and if he doesn't do that at least 5 times a day, he'll be in extreme pain and his nuts could easily rupture\".”Oh well, in that case, I guess it's ok.\" commented the woman. In the very next room, a male patient was lying in bed and it was obvious that a nurse was performing oral s£x on him. Again, the woman screamed, \"Oh my GOD!! How can THAT be justified?\"Again the doctor spoke very calmly, \"Same illness, ma'am! at BUPA, those underage patients are being treated under a new physiotherapy method!!!\"\"Man, that woman's BUPA is out of control!\"Wow, my teacher has a big BUPAkristy ally or oprah have bupasThe bupa is the huge layer of belly fat above the pussy and in extreme cases covers the vagina.Hey Joe, check out the bupa on that fat chick over there, id bet she has to use a hand mirror just to see her pussy."
  },
  "b w rooster": {
    "meaning": " one of the best bounty hunter pkers  best trainer and got married to IDA AND richard164s mom he has 2 sons named rene and kazra and he is bussy with hilda ida and shake and kazras mom everyady and he hates melody cuz she has a big nose",
    "example": " B w rooster 0wned u in pking  "
  },
  "B walk": {
    "meaning": "The B-walk or otherwise known as the Blood walk was originally created by Lil' Rotney, Nephew of Dj Quik. DJ Quik then took the dance and added variations the final product of which was known as the Skip Walk. The B-Walk was first performed on stage by DJ Quik and Mossberg in a show in which they sport yellow shirts at the Recita Country Club. It was first done as a routine and was meant as such until people began to Crip walk against it and therefore came to be known as the B-Walk. The B-Walk was never meant to be taken as seriously as the Crip walk but more as a dance routine and something to have fun with. Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.a dance or step that a blood performs after the murder of a rival gang  member or is performed to insult the  rival gangit is a dance trip for the bloods for their revenge to the crips......The white girl version of the C-Walk (The Crip Walk), and they think they are just copying popular dance and are completely oblivious that they are dancing like Crips.",
    "example": "DJ Quik's B WALK (Blood Walk) video on his DVD Visualism.   The CNN crew was ejected, without explanation, from the BHAZ across from the White House.puppet danceDid you see that Becky do her B-Walk on Instagram. Yeah, she is doing the white girl C-Walk and she doesn't even know she is doing The Crip Walk."
  },
  "B Walko": {
    "meaning": " The act of committing a series of statutory rapes on underage females, and then hiring a call girl to go to a formal event with you, whilst you try to pass her off as your girlfriend.",
    "example": " Tom: Dude that guys' life must suck. Bill: Yeah man he's been pullin a B Walko for years now to try and keep himself happy. He's not fooling anyone though. "
  },
  "b wave": {
    "meaning": " the ripples caused by a girl with nice tits wearing a tight shirt",
    "example": " \"Do you see the bodacious tatas on that broad?\" \"Yeah, she's rockin' a huge b wave\" "
  },
  "B weezy": {
    "meaning": " Southern slang for a phat ass backwood created by the M (Malicious money mob)",
    "example": " Aye I’m finna roll a phat ass B weezy. "
  },
  "b wells": {
    "meaning": " The chosen one. The one who is the steeziest and can do anything with ease.",
    "example": " Yo that kickflip front crook was b wells. "
  },
  "B West'd": {
    "meaning": " A state of complete and total intoxication in which the person is hospitalized and is seen among his/ her peers as having obtained legendary status.",
    "example": " Nurse 1 to Nurse 2: \"Charlie Sheen was in here the other day, almost B West'd\"Student 1 to Student 2: \"Dude! I'm planning on getting completley B West'd on the weekend\"Student 2: \".......Are you suicidal??\" "
  },
  "B Wet": {
    "meaning": " Word Tense: adjectiveDefinition: 1) a phrase to describe a person who allows themself to be physically or mentally abused, 2) self-destructive personality trait.Origins: multiple source mishearing of \"she likes to get beat a little bit.\"",
    "example": " She likes to get her b wet. "
  },
  "B wipped": {
    "meaning": " to be wipped by someone you are not in a relationsip with",
    "example": " My pal Nathan Thomas is b wipped by one Toni Irick  "
  },
  "b with a v": {
    "meaning": " Bro with a vagina.Your best girl friend that's not your girlfriend.",
    "example": " Nah, we're not dating. She's my b with a v. "
  },
  "B X10 CW": {
    "meaning": " Pronunciation- (B X TEN C W)  Stands for Bestfriend times 10 cuddle wuddle.  Or  Best friends that are so close like Sisters or Brothers.  Made by: Ashley Giesler and Amber Kaup",
    "example": " \" Omg shes my B X10 CW\" "
  },
  "B YACUNT": {
    "meaning": " This Uncultured swine tends to be a buck tooth degenerate whom are never down to clown. A very special kind of snowflake who treats woman like complete forking shitaki mushrooms.Has a small D—K complex so don’t say stubby or things will be broken in this donkey Kong tantrum.",
    "example": " B yacunt how could you do this? I could’ve dropped my croissant you bucktooth degenerate looking uncultured swine. "
  },
  "B Yar": {
    "meaning": "B Yar is a phrase applicable to just about any hype situation – its meaning depends on the perspective of the speaker. It can also be used as a sign of agreement. It truly is one of the greatest phrases invented.Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.A sound that one says when one is overly excited or pumped up. A term of agreement (common among pirates). A combination of the words yar and byah(from The Chappelle Show). He thicc",
    "example": "Dude 1: Let's run it tonight Dude 2: B YAR bro-or-Dude 1: (says nothing) Dude 2: B YAR Dude 1: I totally agreeThe CNN crew was ejected, without explanation, from the BHAZ across from the White House.Chris: Yo did you see Kobe drop 40 on the Suns last night?  Graham: Byar.   Hannah: Chris do you wanna hang out tonight?  Chris: Are you going to show me your titties?  Hannah: Byar.   Chris: BYAR! Man I am so pumped we won that game.  Bob: Byar man me too!Dat man is byars"
  },
  "B your L": {
    "meaning": " to blow and or blew your load on someone or something, To ejaculate, ",
    "example": " You should B your L on her T's "
  },
  "B your L on my F": {
    "meaning": " Blow your Load on my Face",
    "example": " I'll even let you B your L on my F. "
  },
  "B Zoo": {
    "meaning": " A name for a mexican when she/he is being stupid.",
    "example": " \"You're a crazy b zoo!\" "
  },
  "B!tchen": {
    "meaning": " Something that looks really cool or attractive Something Punkie or \"fucking sveet\" ",
    "example": " haha I lmao the other day because my mom called her shoes  \"b!tchen\" but they were green-yellow  Yo, that doobie was B!tchen!! "
  },
  "B\"asem\"ent": {
    "meaning": " Where people dwell when their seemingly unfair starting advantage is not quite enough to outweigh their general overall incompetence.",
    "example": " Dude was born into the penthouse, but his sEXiness has landed him right in the B\"asem\"ent.  You believe that shit? "
  },
  "B$": {
    "meaning": " Initals douchebags use when their first name starts with a B and last name starts with an S. Makes them feel better inside because their initials stand for bull-shit. Can be said B money, B cash, or in a negative manner, bull-shit.",
    "example": " person 1: I like to inital my name B$. person 2: Thats pretty gay man. "
  },
  "B$NG.": {
    "meaning": " M$ search engine.",
    "example": " M$ wants ebooks to shift from GOOGLE to B$NG. "
  },
  "b$p $auc X Pete": {
    "meaning": " Two musty fucks who make fire music and will fuck your girlfriend, mom, grandma, or any other female you cherish. it’s also said that they hold the power of 1,000 hurricanes in their voices alone",
    "example": " Did you hear that new b$p $auc X Pete? I listened to it and now my girlfriend calls me $auc or Pete at least once every time we have sex. "
  },
  "B&": {
    "meaning": " B Ampersand B And Banned  Band, usually referring to a barbershop quartet.",
    "example": " <@lol> OMG YOU ARE SO B& *** lol sets channel #WTF mode +b *!@*  Hey man are you going to see the B& tonight? "
  },
  "b& l&": {
    "meaning": " banned land  where the lamers go when they get b& (banned)",
    "example": " Opie is a n00b and should go to b& l& "
  },
  "B&A": {
    "meaning": " Before and After",
    "example": " Check out FOTD; it's B&A "
  },
  "B&B": {
    "meaning": " Bed & Breakfast  when you get a Back rub and a Blow job.  Ship-name, Booth&Brennen of a tv show called Bones.  Breakfast and a blow job. An American tradition of reconciliation between partners, typically occurring after some misdeed by the female. The breakfast always includes eggs, bacon and hashbrowns, but may also include sausage, biscuits, gravy, as well as peppers and onions. The blow job always includes a facial.  Also known as 'BnB' or 'B and B'Talks about an individual who is both bald and bad in bed. Typically these individuals have varying personalities but, they all overlap in the fact that they are bald and cannot last longer than a minute during sex, if even that long.  An alternation of Brews and Bitches, B&B can now refer to Brews and Bros.  To make simultaneous contact to the butt and balls with the hands in such a manner as to cause great discomfort.  This is considered to have the most awkward effect of all nuttaps.",
    "example": " \"...went into the cheap B&B, when I pulled back my sheets to get on into bed found a dead woman there.  So I come downstairs an' I throw her at the manager...\" -George the Angry Redneck  hey babe, I had a really long day. B&B?  B&B are the best couple on Bones! I can't believe you don't like them.  -Dude, you're still talking to her after she puked in your bed?-Yeah, I pretty much had to forgive her when she gave me the B & B.  M: That one night stand was shit. J: That's what you get for using beer goggles. How bad was it? M: He was a B&B J: Oh honey... I'm sorry.  I watched the game last night with my B&B.  Ryan fell to the ground after I gave him the B&B. "
  },
  "B&B Club": {
    "meaning": " 1. B&B stands for 'Blow & Booze' it is an illicit club located in Orlando, FL. It was created by a UCF student around 2002, and has since then expanded to many central florida high schools. It's an underground club known for its 'extreme/lavish parties' and a scene full of 'drugs, sex, and alcohol'. It is very hard to get in to. The initiation is crazy, sometimes involving sleeping with a member of the club. But, once you are in the club you are entitled to unlimited amount of alcohol, friends, money, and drugs. Yet, you have to sell your share of drugs and pay your dues. Once in the club, however, it is very hard to get out.2. Best secret society club in Florida. Usually not spoken about in conversation due to the dangers. But, you will know when you have been to a B&B party. Best f*cking parties ever!",
    "example": " 1. Guy: Yo girl, did you hear that Stacie is the B&B Club's newest acceptee? Girl: Oh crap, I wonder what she had to do to get in?2. Girl: That party was insane last night! Who knew that a highschool girl could throw such a crazy party! Guy: Damn I know! She must be a member of the B&B Club. "
  },
  "B&B Shower": {
    "meaning": " The act of taking a quick shower for the sole purpose of only washing your butt and balls.",
    "example": " John: You don't have time to shower we have to get to the party.Bill: Don't worry, I'm just going to take a B&B Shower. "
  },
  "B&BW": {
    "meaning": " Acronym for Bath and Body Works.",
    "example": " There's some soap on clearance at B&BW... "
  },
  "B&C": {
    "meaning": " Bitching and Complaining  Abbreviation of Bourbon and Coke  Berger and Chips, F1 MB Legend  Strongly unchangeable,implacable, opinionated, intelligent guru of F1 BM'S  BOOZE & COCK! When a group of girls goes out drinking/looking for action.  Acronym. Short For Beef and Cheddar. The flavor combination used in many foods. Commonly found in the Hot Pockets brand.  n. A bitch and cunt.",
    "example": " Please stop all that B&C dude.  \"Can you get us a B&C while you're at the bar?\"  To do a B&C. (as to keep a straight line on a twisty road)  Betty: Let's go out drinking tonight and find some peen! June: B&C Night Girls! Booze and Cock!!  \"Dude, lets get some Pepperoni Pizza Lean Pockets!\" \"Are you serious? LEAN POCKETS!? No way, B&C dude...   B&C\"  You know Tonya?The one who hangs out on the corner? That girl's a b & c, stay clear. "
  },
  "B&D": {
    "meaning": " Bondage and Domination  Referring to the practice of restraining a sexual partner and then asserting one's control over them through a variety of methods, including, but not limited to:  * forced sexual positions * humiliation * forced climax  Not to be confused with S&M, which refers to pain play.  See also: Bondage  Acronym for Bhadwa & Dalal which aptly describes the Govt's bootlicking media houses of India. Can be identified by 24*7 telecast of biased fake news, spewing of communal hatred, hiding Govt's failures and loud noise on prime time with 15+ debaters on an half hour debate.Can be used for fox news by all means.  Bondage and Discipline (*not* Bondage and Domination, as most people think).  Bondage and Discipline/DominationS & M Race Play  A safe for work slang term used by African Americans do describe there penis! B&D *black& decker*  Booze and Dick.  The drunk girl's version of TLC.  This is catering terminology Beef and Dumplings.",
    "example": " \"Put on your leash. It's time for some B&D.\"  \"No my dear friend, I call you B&D. Aur batao.\" \"Fox news is such a B&D of trump these days\"  He taught her the tricks of B&D, starting with simple commands such as, \"Take off your clothes and stand in the corner for 3 hours with this butt plug in your hole.\"  Q: \"Do you like B & D?\" A: \"Sure, tie me up, then whip me good all night long.\"  That girl Erin I'm seeing..she loves my B&D!Or *hey that old lady rose..I hear she low key wants Rick's *B&D*  I am too wasted to eat my eggs.  I don't want any food.  All I want in life is B&D.  The lads from the Circus usually dined in the truckers cafe  across the road from the Big Top. The cafe made excellent B&D "
  },
  "b&e": {
    "meaning": "short for breaking and entering. gaining unauthorized access to a building or property, usually for the purpose of robbery and/or vandalism.Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.\"breaking and entering\"Breaking and Entering 1. Forcing entry into a home or other building that does not belong to you.  2. The criminal record of the act described above.  3. Great way to make some fa$t ca$h when you're in a tight spot and the loan sharks are after you.Breaking and entering. Bacon and eggs, according to Dane Cook. A common breakfast meal.Short for \"Beat it & Eat it\" or \"Beat it up & Eat it up\"; The act of a male performing oral sex on a female immediately following intercoarse.",
    "example": "\"I've always wanted to do a B&E. And you're like 'Dane, what's that? Bacon and Eggs?' No. Although I'd take Bacon and Eggs any day, cause that's fucking delicious.\" -Dane CookThe CNN crew was ejected, without explanation, from the BHAZ across from the White House.That gangsta got caught for doing a B & E and now he is going to gangsta college.1. \"Dude, so we B&E'd the donut shop last night...\"  2. \"I did 6 months for B&E.\"  3. \"Vinny and Joey were gonna break my legs, so Tito and I pulled a few B&E jobs, and scraped together some fast cash.\"Dude, I totally just did a B & E! Did you take anything? No, I just busted  the guy's door down and he started freaking out, wondering what I took!I'm always game for B & E. That's delicious in my belly.\"Dude, last night she told me she wanted me to eat her out right after I beat it up\"\"Oh so she wanted you to pull a B&E\""
  },
  "B&E Shoes": {
    "meaning": " Shoes that the common black male would wear such as AIR Jordans and Air Force Ones, termed B&E shoes by Law Enforcement for the fact that many of the scenes of a burgulary will have a AIR Jordan or Air Force One foot prints in the dirt",
    "example": " Detective: The Evidence Technician just told me he photographed a couple of B&E shoes prints in the dirt by the window. Cop: im not at all surprised at all. "
  },
  "b&f": {
    "meaning": "back and forthBlack House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.when those fucking marathon runners are closing in on a newby runner, you'll often see the newby taking a convenient (and not at all obvious) stretch break.. going back and forth - a.k.a. b & f - from one leg to the other until it's safe to start walking without being noticed by the not-so-newby",
    "example": "i got really jealous when i found out my boyfriend and this girl were texting and snapchating b&f🙄The CNN crew was ejected, without explanation, from the BHAZ across from the White House.\"i can hear the fucking marathon runner coming! quick! do the b & f!\""
  },
  "B&G": {
    "meaning": " Blow and Go. Term used by adult service providers for a quick blowjob  B & G Is short for (Blow and Go), this is often found in online personals ads -- especially for casual sex. Meaning Oral Sex and then leave.  biscuits and gravy usualy bought at a bodega",
    "example": " Used in erotic adds by adult service providers for a quick blowjob.  Cragslist..... B&G $XX.  Bobby responded to a personal ad for a B & G and had a great time.  yo that b&g was killer "
  },
  "B&H": {
    "meaning": " Code word between men used within the presence of easily offended females. Stands for Bitches & Hos.   Short for \"black and hairy\". A description of a hirsute man with black hair.  Short for Benson and Hedges, a popular cigarette brand with young students in New Zealand.",
    "example": " Trish: Jon, I want to go to the movies.  Jon: Why can't we just chill here with Dennis?  Trish: You know what? Fuck off. Nevermind.  Jon: But--  Dennis: B&H, man. B&H.  Jon: No fucking shit.  Trish: Excuse me?  Jon: Shut up, B.  Dennis: Yeah, fuck off, H.  Check out Alan. He sure is B & H.  Customer (to shop attendant):  Hey bro, can I grab 2 20's of B&H? "
  },
  "B&J": {
    "meaning": " B&J, is commonly used to refer to the popular ice cream brand Ben & Jerry's",
    "example": " Hey bro, you want a B&J? Nah, I'm good "
  },
  "B&M": {
    "meaning": " Brick and Mortar  Bolliger & Mabillard, roller coaster manufacturers. B&M coasters offer a very smooth ride, and the characteristic roar caused by the polyuthereane wheels on hollow track. B&M is so called because of its founders, Walter Bolliger and Joseph Mabillard  Examples of B&M coasters include: Nemesis, Oblivion, Mantis, Raptor.  Black and Mild.  A pipe tobacco cigar sold in the tip cigarillo form.  It has a nutty vanilla scent and a pleasing aroma.  v. Bitch and Moan. When a person can not stop voicing their opinion after losing an argument.  Could also be bitching and moaning.  Bolliger & Mabillard - rollercoaster designers famous for fast, smooth, twisted track with the characteristic ROAAAAR! sound, caused by polyurethane wheels.  Affectionately referred to by coaster enthusiasts as \"Beamers\".    is a type of shifter in cars for both manual and automatic transmission.  usually used in high performance cars, such as modified mustangs and camaros.  you can find a B&m shifter usually being used by a guy with a mullet.  A large shop that sells discount goods",
    "example": " This purchase is not available online, only B&M  OMG that B&M was great! How do I know that was a B&M? By the characteristic roar! Did I mention I'm a rollercoaster enthusiast?  Go in, get Johnny a pack of Camels and get me a couple B&Ms  God!! We told you that if you told another lame joke we'd tie you up and put you in the trunk! Stop all yer  B&M(ing) you little girl!!  Check out that new flying B&M that Six Flags New Jersey just built!    damn boy, that is a sweet ass car.  you got a B&M shifter in that thing?  I can buy all kinds of cheap stuff at B&M "
  },
  "b&m broadband": {
    "meaning": " Based on the UK store name b&m bargains, popular for being cheap and \"jippo\" saying someone has \"b&m broadband\" states they have a rubbish connection and a cheap internet, mainly when playing on a video game and lagging.",
    "example": " rob: omg harry you have b&m broadband harry: not my fault its lagging "
  },
  "b&m style": {
    "meaning": " The act of puffing a dong like it was a black and mild.",
    "example": " <DK> What's the difference between a b&m style dong puffer and Matty Mil?  <Matty Mil> Well... b&m style dong puffers puff dong like its a b&m, Being Matty Mil means... you... don't suck dong at all. "
  },
  "B&O Rail Road": {
    "meaning": " Another way of saying Black 'n Out.",
    "example": " I'm trying to conduct the B&O rail road tonight. WOO WOODamn carl, you must of had one crazy ride on the B&O rail road last night. "
  },
  "B&P": {
    "meaning": " n. Blank CDR and postage; used in the music trading community. v. to send a B&P  Derivative of Borescope and Pullovers, as completed prior to a live fire exercise, derived from a Cavalry Scout, Former Recruiter, avid Fisherman, turned Supply Sergeant, trying to assimilate to the Field Artillery.  means bra and panties. Easy way of telling a girl what you'd like to see her wear.  Beer and Pussy",
    "example": " Send me a B&P and I'll burn you a copy of the show.   Supply Sergeant: We got mechanics scheduled to do our B&P's. The Sarge: What the f@ck are you talking about Tommy?!?  hey baby I bet you'd look good in some b&p  \"All I need in life is some B&P\"  \"Hey are you going to come to my party Saturday night?\" \"Only if there's B&P!\" \"Duh\"   "
  },
  "B&Q": {
    "meaning": " a store in the UK that sells mysterious items ranging from trees to paintings. however B&Q's are always on the middle of a motorway and they have little convenience.isa shop 🅱️",
    "example": " son - dad we've ran out of batteriesdad - alright i'll pop down to B&Q "
  },
  "B&R": {
    "meaning": " It's another form of saying Based and Redpilled  Short for \"Blast and Relax\" and/or \"Blasting and Relaxing\"; the act of relaxing on the toilet for an extended period of time while doing significant damage to the toilet bowl; can refer to shits of all types but is typically reserved for the most explosive  \"Born and Raised\" To be born and raised in a certain place, as opposed to an outsider or new arrival.  To black out and rail",
    "example": " Man: Grandpa's talking about the bankers again..... Man 2: B&R grandpa  \"This class needs to end soon so I can head back to my dorm and B&R\"\"Don't bother me when I'm B&R; I may look calm but it's a mess down below.\"  \"Is he from Jersey City?\" \"That boy's a B & R from jump street.\"  Last night I took 15 shots and B&R'd "
  },
  "B&R Syndrome": {
    "meaning": " having a lot in common with a really sweet and decent looking guy who likes you a ton but having NO feelings for him at ALL",
    "example": " R: He's soooo sweet but I feel NOTHING B: i TOTALLY GETCHU!! Like!!!! Omg! R: I wish I liked him :( Another day with B&R Syndrome.... "
  },
  "B&S": {
    "meaning": " Bait & switch: Internet, newspaper, or phone advertisements, which may include photos, written or verbal descriptions, do not match the woman who shows up, or she has been grossly misrepresented.  Batchelors and Spinsters. An Australian term for a semi-formal get-together in the outback. People dress up in formal wear and go to someone's barn or shed to dance, get drunk, hook up and pass out in the back of a ute (trayback vehicle). Although it sounds rough, it's for private schoolies mostly, because of all the landed gentry.",
    "example": " Escort: That agency is known for B&S.  'I hooked up with Sharon at that last B&S out at Jack's place.' "
  },
  "B&T": {
    "meaning": "Short for \"bridge and tunnel\", the term refers to those who travel into Manhattan from outlying areas such as New Jersey and Long Island to take advantage of the city's nightlife.  The term may also include those who come into Manhattan from New York City's other four boroughs.    The term is often used in a deragatory manner indicating that those who fall under this term are young and/or trashy and dilluting the quality of New York nightlife.Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.Bridge & Tunnel, people that do not live in Manhattan, but live nearby and have to enter to entertain themselves via either... bridge and tunnel trashBig and Tall. As in sizes made for men. Usually found in most department and retail stores. Also used by \"downtown\" residents in Vancouver, BC, Canada. As you have to take a bridge or tunnel to get downtown from many of the suburbs. Usualy used to make fun of a person who is B & TTo boat and toke. Going out on a boat with the objective to smoke or consume marijuana.",
    "example": "Do you want to go to that new club on Thursday instead of Friday so that we can miss the B&T crowd?The CNN crew was ejected, without explanation, from the BHAZ across from the White House.Avoid Thursday night at the Park Cafe as it's begun to draw a real B&T crowdWhat Manhattanites call intruders (who don't live in Manhattan) who uses bridges and tunnels to enter into Manhattan.  \"Guido is so B&T!  He needs to go back to Jersey!\"This store sells B & T stuff. \"did you check out the B & T crowd at the movie tonight\"Man #1: Hey would like you to B&T tomorrow afternoon on the speed boat? I hear the weather will be absolutely splendid!Man #2: You bet your sweet ass I do!"
  },
  "B&Ters": {
    "meaning": " Short for \"bridge and tunnelers.\"  People who hang out in Manhattan but live elsewhere and come in on a bridge or tunnel.  Generally have a trashy reputation among Manhattanites, but in reality can range from sketchy Jersey shore guido types to normal Brooklyn/Queens residents who didn't want to shell out $2000 a month for a closet-sized shithole in The Village.  Surprisingly, most B&Ters are nothing like the guy in \"My New Haircut.\"  Still snobbier Manhattan residents usually stay away from bars/clubs frequented by the B&Ters.",
    "example": " Jersey shore guido: \"Out of the way, broski.  Me and my boys are ready to down some fuckin' Jager bombs.  We're gonna get wasted and grind on every piece of pussy in this place.  The bitches are gonna love my new haircut.\" Roxbury bouncer: \"This is the Roxbury.  We wouldn't allow trashy B&Ters like you guys in this club even if you had Jessica Alba with you.\" Jersey shore guido: \"Not now chief, I'm in the fucking ZONE!\" (tries to walk in, ends up in nearby dumpster) "
  },
  "B&W": {
    "meaning": " 1. Black & white (Photography / Cinema / TV) 2. Bowers & Wilkins (HI-FI speakers)   Black-and-white (photography, cinematography, etc.)   The lazy persons way of writing blck and white.",
    "example": " 1. Young Frankenstein is one of the funniest B&W films ever! 2. I pump loud vibes on my B&Ws  A: i've got a B&W photo  The picture was B&W "
  },
  "B'acne": {
    "meaning": " Acne, on your back.   Zits on a person's back.  Back-acne, acne on the back  Acne on someones back, male or femele.  the disturbing acne found on a person's back...not to be confused with chacne which is found on the chest  a large amount of acne on ones back  When you have a whole bunch of zits on your back you have 'bacne'",
    "example": " 'YAY! its b'acne day! and to think i was going to wear that lovely back less number. polo neck it is then...i love summer.'  Ewww check out his bacne!  Her bacne is so bad that she cannot wear a strapless dress.  Man, that dude has serious bacne!  I don't like to watch Snitsky wrestle due to his excessive bacne.  It took me two hours to pop every single pimple on my back.  This bacne is gross.  Did you see Zacks bacne!?!? "
  },
  "B'Administration": {
    "meaning": " (n.) The George W. Bush Administration; its performace has not been good, so the ready contraction \"B(ush)'(Ad)ministration\" flows from the administrations many failures.  The current Republican White House administration, headed by the Orange Jesus.  B'Administration. If you Badministrate on someone, you beat them or get one up on them.",
    "example": " The B'Administration continues to deny that Iraq has become a security mess since our invasion and that terrorists who weren't there before have now found their way in during the confusion?  Did you see Rex Tillerson just got the boot from the Badministration?  Yeah Bitch. I just Badministrated yo ass! Go make the dinner you fat ho! "
  },
  "b'ak'tun": {
    "meaning": " the 400-year span as given on the Mayan Long Count Calendar.",
    "example": " The 13th b'ak'tun ends on December 21, 2012. "
  },
  "B'alreet": {
    "meaning": " What ever you do wrong, or damage, break dont say sorry say b'alreet  hey hey. this is a sexy beast. man o man. every guy wants to get with her. ow ow!!!!!!!  The most caring most pretty girl you will ever ment. She has the boys out said her door whating to ask her out. If you know one than youshould never let her go. She is caring and crys sometime but that will not stop her for being who she need to be  The most caring most pretty girl you will ever ment. She has the boys out said her door whating to ask her out. If you know one than youshould never let her go. She is caring and crys sometime but that will not stop her for being who she need to be",
    "example": " Alex \"brady you have just broken my car seat!\" Brady \"dont worry it will b'alreet\"  Alex \"brady you have dented my car roof!\" Brady \"dont worry it will b'alreet\"  Cute stuff  Guy 1: who is that fine gurlGuy 2 : that is balreetGuy1:she is going to be mine soon  Guy 1: who is that fine gurlGuy 2 : that is balreetGuy1:she is going to be mine soon "
  },
  "b'awwwwww": {
    "meaning": " 1. v. To express a very melancholy tone towards another for an asinine reason. An incredibly annoying sound that emo children make when things don't go their way, such as an emo male being turned down for anal sex from his emo boyfriend.  2. n. A state of anguish that one falls into when something mildly irritating happens to them",
    "example": " He lost his iPod and started b'awwwwwwing.  He couldn't find his box-cutter so he began b'awwwwwwing. "
  },
  "b'chass": {
    "meaning": " Contraction of the word bitchass.",
    "example": " A: Yo heard I heard you suck nuts. B: Shutcho b'chass up "
  },
  "B'DAM": {
    "meaning": " Proper noun, exclamation1. B'DAM is a corporation that was founded in late 2010 by Brian, David, Alyssa, and Madeleine. Together, their initials make B'DAM. The company has expanded over the years, having successfully implemented ventures in adult entertainment, architecture, recycling programs, personal betterment, strip clubs, massage parlors, lingerie stores, and more (as listed in the monthly B'DAM Catalogue). Its official trademark is: \"If you feel it, let it happen.\" 2. Alternate spelling: BJ'DAM. Josh, an appendage to the original Four Founders, is featured in this spelling. 3. B'DAM has become so interlaced in pop culture that the name is now used as an exclamation, replacing the simple \"damn.\" 4. Generous benefactors of B'DAM include: Sluts and Spending Cuts PAC, Church of Latter-Day Saints, MegaViiiibes, the general San Fernando Valley, and BSpears  Big Dumb Action Movie; Usually a hugely over budgeted Hollywood movie intended to get as much money as possible with the littlest amount of effort; Movie that are made almost entirely out of CGI with 3/4 of it being some kind of explosions.",
    "example": " Barbara: Damn, that was a good Silent Spring book report! Just damn! Tyrone: I believe you mean B'DAM, Barbz. And thanks, I copy and pasted it from Rachel Carson's website.High school kid 1: How can I become a sexy freak? High school kid 2: I heard you need to contact B'DAM. I heard all the boys wanna go down when B'DAM is in town ;)  guy 1:did you see that new Transformers movie? guy 2: I wouldn't waste my time with that BDAM "
  },
  "B'danked": {
    "meaning": " Term coined on acid in Roosevelt National Forest that describes something that looks or has been made dank. Yuhh",
    "example": " We b'danked the hell out of the scrambled eggs. "
  },
  "b'darky": {
    "meaning": " a dark, slimy, bottom fish or nigger",
    "example": " that b'darky made off with my bicycle!The projects are full of all dem b'darkys. "
  },
  "B'dass": {
    "meaning": " conjunction of 'bad ass'. the feeling of being b'dass. something that is b'dass. having a b'dass attitude. use it in school when your teacher is a stuck up bitch and doesn't allow you to say ass.  Something so amazing and Bad ass that you are too excited to say the first \"A.\"   balls, dick and ass, used to describe the social atmosphere of a location or a smell.  Bad Ass. Fresh. Dope. Ill. Sick.  contraction of \"bad ass\"  A wicked combo of Bad & ass, Without the first \"a\". Usually used to describe something Really Cool.  this word is a kin to bad ass just shorter and lazier some times it can aven be cooler",
    "example": " So how's that rock n'roll music going? B'dass look how B'dass Anthony looks today. you know what would be b'dass?  \"Man, Chuck Norris is so (Bdass), it breaks my optic nerve to even watch Walker, Texas Ranger!\"  there's nothin but a bunch of bdass in that house  That concert was b'dass. Especially the stage dive.  Steve drank a case of Bd'ass this morning   Kid #1: That fool just nailed a Triple Back flip on ATV fury 2. Kid #2: No way, How Bdass! Kid #3: Fuckin Homos'.  person a: \"hey did you see paul kick that emo kid in the face\" Person b: \"ya it was b-dass\" "
  },
  "B'dassery": {
    "meaning": " The english version of bad ass behaviour.",
    "example": " \"Why I say Sir, the B'dassery I have witnessed in todays cricket match is quite extraordinary. I do say, fancy a cup of tea\" "
  },
  "b'datch": {
    "meaning": " Euphemism for \"bitch\"",
    "example": " Those shoes are mine,  b'datch.  "
  },
  "B'daydas": {
    "meaning": " You can serve them mashed, or whipped or boiled. POTATOES.   (Boston slang/accent)",
    "example": " Ma, are we having b'daydas with suppa? "
  },
  "b'donky": {
    "meaning": " slang for a large doinga",
    "example": " example \"look at my huge b'donky!\" "
  },
  "b'doosie": {
    "meaning": " a small, hairless man with a penchant for nihilistic memes and self masturbatory humorous facebook statuses. he doesn't like shit. he doesn't go outside.",
    "example": " \"that guy drew is such a b'doosie.\" \"yeah man he made like 4 memes yesterday.\" "
  },
  "b'doozy": {
    "meaning": " A b'doozy occurs when anal sex is being performed and the recipient releases flatulence resulting in the vibration of the phallic organ. See also, Oopsie-b'doozy.",
    "example": " b'doozy comes from the word \"doozie,\" as in the case of the release of a large fart and someone in the immediate vacinity proclaims, \"That was a doozie.\" However, in the case of a b'doozy, the person who would normally proclaim the previous statement is occupying the farter's butt, hence the \"b\" in b'doozy. \"Jane gave me a b'doozy and now I need to take a shower.  "
  },
  "b'dush": {
    "meaning": " the sound of faeces hitting water. see dush.",
    "example": " \"when I shat in the ditch it made a sound like \"b'dush\"\". "
  },
  "b'eggl": {
    "meaning": " A bagel with egg and cheese.",
    "example": " I'm gonna get a b'eggl and some coffee for breakfast. "
  },
  "B'Elanna": {
    "meaning": " A girl doesn't give a fuck if you like her or not. She can take care of her self in tough situation. If you get to know her she is one of the nicest people you'Lloyd ever meet. She loves her friends and family and if you try to fuck with any of them she will take actions and you'll be really sorry.  The first name of a Star Trek: Voyager klingon-human hybrid character.",
    "example": " Joe: I don't like B'Elanna she is rude Lewis: She is rude to people who are fake. Joe:wow Lewis:😐  B'Elanna Torres is my favourite character from Star Trek: Voyager! "
  },
  "B'Elanna Torres Syndrome": {
    "meaning": " Where women in science fiction TV series/films are much more attractive as aliens than they are in real life. Named for the character in Star Trek Voyager.",
    "example": " \"That Chiana in Farscape is surprisingly ugly in real life.\" \"Yeah, she's got B'Elanna Torres syndrome.\" "
  },
  "b'fle": {
    "meaning": " The ebonics slang term for beautiful",
    "example": " Awww my new Porsche 911 is b'fle. "
  },
  "B'gaggit": {
    "meaning": " Loud ass fart, where your ass speaks a word as you fart",
    "example": " B'gaggit is a earth shattering fart, on top of that your ass speaks to you \"b'gaggit\". Damn girl that was a loud fart... Did I hear your ass say b'gaggit? "
  },
  "B'Gay": {
    "meaning": "When something goes above and beyond the point of lame to the point where comparing it to plain homosexuality isn't good enough. The \"B\" adds an extra syllable, adding more intensity and homosexuality to whatever you're insulting.Black House Autonomous Zone. The area around Lafayette Square, Washington D.C. It is in reference to Seattle, Washington’s Capitol Hill Autonomous Zone CHAZ.When you've reached an entirely new level of homosexuality.Adjective used to imply that someone is gay.A very \"go\" person is named Bgay. We name them preferibley if there name is BJ.",
    "example": "\"Hey man, I can't hang out, my mom's PISSED.\" \"Shit foo, that's extra b'gay!\"The CNN crew was ejected, without explanation, from the BHAZ across from the White House.\"I just bought some rainbow suspenders and like, sixty-nine flannels at Hot Topic.\" \"Wow man that's like, extra b'gay.\"zomg ur teh bgay. i'm the bgay!\"Bgay man fuck off\" \"I love Bgay :)\" \"Bgay, deja vu?\""
  },
  "b'ger": {
    "meaning": " a noise used by someone who is disabled",
    "example": " fuck me, the only thing he said was b'ger "
  },
  "B'gerk": {
    "meaning": " To backhand someone in the junk. Back slap the twig and berries. Upper-cut the cock and balls. There can be multiple techniques depending on the style of the b'gerker. It is important to mention that it is not a true b'gerk if the person knows its coming. It must come when the person least expects it.",
    "example": " Roman told his girlfriend something inappropriate I said so for payback he will get brutal b'gerking. "
  },
  "b'ghetto": {
    "meaning": " Characteristic of or pertaining to the Ghetto, where \"Ghetto\" is used in a derogatory sense. An alternate form is \"b'getto\".",
    "example": " That's b'ghetto, yo. "
  },
  "b'gind gind": {
    "meaning": " named after the lesser known celebrity 'Slather B'gind gind' it is when youre hair or face is greasy or slicked back. ",
    "example": " moe:eurgh, i look disgusting my hair is all b'gind gind. oowahoo:i no, its crawling around in that oil thats done it. "
  },
  "b'gock": {
    "meaning": " what happens when ninja bass bombs are dropped on people's faces.  ",
    "example": " My croosh bass bombs b'gocked the shit out of those custies, ya heard?  Lets go get stank-faced.     "
  },
  "b'good": {
    "meaning": " Adj. \\bā-gūd\\A term used to describe an object, trend, or creative work that has reached a depth of awfulness according to the standards of the present time, demanding an appreciation for its advancement into the realm of ironic originality.",
    "example": " Tommy Wiseau's \"The Room\" (2003) is infamously b'good to the nth degree. "
  },
  "b'goodness": {
    "meaning": " my goodness (b'=my)",
    "example": " B'goodness captain! -Astronaut's last words before a meteor completely demolished his spaceship. "
  },
  "B'gort": {
    "meaning": " What Amish people say",
    "example": " B'gort(Translation: yeet) "
  },
  "B'grrness": {
    "meaning": " B'grrness first came into use in California in  2004.  It is used primarily as an interjection (1), though is often used as an adjective (2), and less commonly can be found in virtually any part of speech (3).    It was coined by John-Clark Levin with the purpose of sounding like valleygirl-esque doubletalk (similar to the Ishkabibble of the thirties).  B'Grrness has since gained momentum with the help of internet bloggers who are trying to push the word into mainstream usage.",
    "example": " 1.  \"This lady was like, 'maybe we can just be friends?' and I was like you know  what, b'grrness lady!\"  2.  \"Wanna come downtown?  I heard about this hot sushi place. It'll be sooo b'grrness.\"  3.  \"Come on you f***ed-up b'grrness, gimme your best shot!\" "
  },
  "B'ham": {
    "meaning": " Bellingham, Washington. a short phrase for one of the crunkest cities in the rainy northwest.    Shortened term to describe the English City of Birmingham   shortened version of the Washington town of Belligham  BHAM! n. an announcement or exclamation of someone being pwn3d on an internet message board. Originated from the screen name of  a dawgman.com poster who frequently uses 'witty' posts to beat down Cougar and Duck trolls. Can be used in situations of irony as well.  Birmingham,Alabama. a short phrase for one of the crunkest cities in the dirty south.   An all around stud. The greatest farter of all-time!",
    "example": " the most ill city in the rainy rainy northwest, B'Ham   \"Im going to bham the weekend\"  Bham is home to Western Washington University!  ASU: Man, it's 124 degrees outside! Sven: No one cares! Cabrini: BHAM!      the crunkest city in the dirty dirty south, B'Ham  Wow, that guy is such a B-Ham!! "
  },
  "B'harne": {
    "meaning": " 1. n. Vile, evil demon, appearing as a small, friendly, toothless purple Tyrannosaurus Rex.  Takes a particular interest in small children, using the guize of love and friendship to enslave them and otherwise fill their heads with ridiculous and unrealistic notions.  Children subjected to such items as it's song \"I love you, You love me,\" reach adulthood in a state of profound cranial rectitis, and is a possible explanation for that condition being suffered by most of the denizens of Hollywood.   2. Can be spelled \"B'harnii\" as well.",
    "example": " My daugher has been enslaved by B'harne. "
  },
  "B'harnii": {
    "meaning": " Demonic alternate spelling of \"Barney\", frequently used during the anti-Barney craze of the mid- to late-1990s. It is said that when one changes to U's to V's in \"CUTE PURPLE DINOSAUR\" and extracts the Roman numerals, they add up to \"666\"",
    "example": " \"I hate you, you hate me, let's all get together and kill B'harnii...\" "
  },
  "B'HEUPING": {
    "meaning": " When parties of three swap spit for long periods of time in dark hallways. Underage person(s) required. The term for a threesome, but instead making out.",
    "example": " Dude, Sean definitely was b'heuping with those chicks last night. "
  },
  "b'hotch": {
    "meaning": " It's a different way of calling out someone.And depending on the delivery, attitude and tone. To another person, it can come across as positive or negative because it's in the delivery of the word.Its a less offensive way of calling out someone as a \"Bitch\".",
    "example": " What's up B'hotch.?? I am telling you Sara can be a B'hotch some days. "
  },
  "b'Hre": {
    "meaning": " The shortened version of the name bar Hretzin. Typically spelled with a lower case b, an apostrophe, and an  uppercase H. example: b'Hre. It is pronounced \"bear\" for ease of use. It is used as an alternate spelling to the typical nickname of bear. Other examples of the name are bhre and bHre.",
    "example": " I just saw b'Hre on the high street.  "
  },
  "B'in my Bs": {
    "meaning": " an abbreviation of the term \"bustin my balls.\"  similar to: grinding my gears, busting my chops, etc. also much more widely usable in public, and around formal guests. Most appropriately used when someone is \"telling you their life story\" or any other completely unnecessary information that is annoying and/or unneeded.",
    "example": " Marsh: \"I love this band.\" Luke: \"Did you know that the lead singer was once addicted to basket weaving? When he was 13... Marsh: \"Dude. Luke.  you're B'in my Bs bro\" "
  },
  "B'in My C": {
    "meaning": " Short for blocking my cock. Usually used when girl you want to hook up with is around.",
    "example": " John: Hey Kim want to go outside and count starsJoe:I'll come too!John: Dude, You're totally B'in my c "
  },
  "b'jang": {
    "meaning": " \"b'jang\"  onomatopoeic word for \"grope\", actions are ALWAYS included, can be specific: b'gentitals, b'face, b'moob etc see also: Boots' moobs, Boots' Genitals, Boots' Face  a noise that complements a grope  various spellings and pronounciations exist: bichang, p'jang, pichang etc   a word made by a kid in amherst new hampshire which means really nice or uncontested",
    "example": " girl 1: i totally b'janged his moob girl 2: he has the biggest moobs i have ever seen  college guy: ....i scored so much b'jangage last night!  jackass friend: i wish i did. i sat at home all alone, there was no one there to b'jang but myself  that chick's bedonk was like b'jang "
  },
  "B'jangle": {
    "meaning": " To become twisted up. When something becomes tangled up.",
    "example": " I had to where tighty whities instead of boxers, other wise the boxer would've gotten all b'jangled in my crotch. "
  },
  "B'jankity": {
    "meaning": " A word used to convey a state of something being completely weird and stupid. It can be used in the place of fubar, lame , F*cked up and/or retarded. For example, instead of saying \"My brother is being a dumb lame jerk\" you would say \"My brother is being b'jankty\". Because it is such a rare and wonderful word, it is highly important to spell it correctly (b'jankity) and to pronounce it correctly (buh-JANE-kuh-tee).   The word originated around the Avon, IN area and has built and grown upon its own success in recent years.  ",
    "example": " \"Holycrap, that test was freaking b'jankity!\"  \"Dude, that was a lame-ass b'jankty excuse for not coming with us and hanging out yesterday.\"  \"WTF happened to your head?! Your hair is all b'jankity\" "
  },
  "b'jawn": {
    "meaning": " A word used by Philly cats and Cheltenham kids used to describe anything or everything without using the word jawn. Basically, it's a cooler way to say jawn.",
    "example": " Look at that b'jawn! My sister's at the b'jawn. I ate three of them b'jawns. "
  },
  "B'Jello": {
    "meaning": " To be lazy or lethargic, but cool at the same time. A lazy behavior that one is commended on instead of scorned for.",
    "example": " Guy 1: What are you doing today? Guy 2: Gonna chill by the pool and hang out. Guy 1: Dude, that's so b'jello! "
  },
  "B'jesus": {
    "meaning": " Irish term, to be startled.  A term used when the shit gets literally scared out of you, basically put it is jesus with a \"b\".  More than good God and Jeus Christ, this is a crazy amount of shock. Often accompnied by stammering and lack of actual human communication.",
    "example": " She crept up behind me and scared the B'jesus out of me.  You scared the bjesus out of me!  B'jesus, 3 nipples maybe but five?? That just takes the piss! "
  },
  "b'jingo": {
    "meaning": " The female genitalia or vagina. Used commonly in lieu of afformentioned \"dirty\" words associated with \"big people talk\".",
    "example": " \"I went to the girl doctor and she said that my B'jingo exam went great!\" "
  },
  "B'joard": {
    "meaning": " To type in a frantic and random fashion on one's computer.",
    "example": " B'joard/B'joarding/B'joarded (buh-jored)\"Keith dont b'joard me!\" Cried Marytha. But Keith leaned over and b'joarded her anyways. "
  },
  "B'joina": {
    "meaning": " vagina, poontang, flange.",
    "example": " can u smell rotten b'joina? "
  },
  "B'Jongay": {
    "meaning": " Term used to describe an odor that combines the pungent flavors of pussi with sweaty ass.  An aroma associated with people who have multiple folds of skin, or thighs that rub together.  The term can also be associted with a female who neglects to clean her Twizzy. ",
    "example": " \"Dang-this blanket smells like B'Jongay.\" "
  },
  "b'jrbl": {
    "meaning": " (Buh-jar-bul)To call or text a person using your butt.",
    "example": " b'jrbl \"Augh! Tim just sent me a text saying 'fhjklasdug'\" \"Huh. Me must've b'jrbled you.\" "
  }
}
